#pragma once

/**
 * Name: Rumbleverse
 * Version: Latest
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function IGActorSystem.IGNotifyStateBase.UpdateMontageName
	 */
	struct UIGNotifyStateBase_UpdateMontageName_Params
	{
	public:
		class UAnimMontage*                                        InInstance;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGNotifyStateBase.IsRunningOnOriginalMontage
	 */
	struct UIGNotifyStateBase_IsRunningOnOriginalMontage_Params
	{
	public:
		class UAnimMontage*                                        InInstance;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAccessory.ResolveTextCultureInvariance
	 */
	struct UIGAccessory_ResolveTextCultureInvariance_Params
	{
	public:
		struct FIGContentReleaseVersion                            CurrentVersion;                                          // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAccessory.IsTextCultureInvarianceDirty
	 */
	struct UIGAccessory_IsTextCultureInvarianceDirty_Params
	{
	public:
		struct FIGContentReleaseVersion                            CurrentVersion;                                          // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorModValueManager.ServerDebugSetModifiedFloatBaseValue
	 */
	struct UIGActorModValueManager_ServerDebugSetModifiedFloatBaseValue_Params
	{
	public:
		int32_t                                                    index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      BaseValue;                                               // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorModValueManager.ServerDebugRemoveStackFloat
	 */
	struct UIGActorModValueManager_ServerDebugRemoveStackFloat_Params
	{
	public:
		int32_t                                                    TargetStat;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EIGModType                                                 ModType;                                                 // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_48XV[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      ModValue;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorModValueManager.ServerDebugClearAllStackFloats
	 */
	struct UIGActorModValueManager_ServerDebugClearAllStackFloats_Params
	{	};

	/**
	 * Function IGActorSystem.IGActorModValueManager.ServerDebugAddStackFloatTimed
	 */
	struct UIGActorModValueManager_ServerDebugAddStackFloatTimed_Params
	{
	public:
		int32_t                                                    TargetStat;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EIGModType                                                 ModType;                                                 // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_2FWN[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      ModValue;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Time;                                                    // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorModValueManager.ServerDebugAddStackFloat
	 */
	struct UIGActorModValueManager_ServerDebugAddStackFloat_Params
	{
	public:
		int32_t                                                    TargetStat;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EIGModType                                                 ModType;                                                 // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_OUZU[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      ModValue;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorModValueManager.OnRep_ModifiedCharacterStats
	 */
	struct UIGActorModValueManager_OnRep_ModifiedCharacterStats_Params
	{	};

	/**
	 * Function IGActorSystem.IGActivatedPerkData.Deactivate
	 */
	struct UIGActivatedPerkData_Deactivate_Params
	{
	public:
		class UIGActorPerkManager*                                 Owner;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EPerkActivationType                                        Type;                                                    // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_2PLI[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    CurrentStackLevel;                                       // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UIGActorPerkManager*                                 OtherTarget;                                             // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       OverrideTriggerCondition;                                // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActivatedPerkData.Activate
	 */
	struct UIGActivatedPerkData_Activate_Params
	{
	public:
		class UIGActorPerkManager*                                 Owner;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EPerkActivationType                                        Type;                                                    // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_OC4X[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    CurrentStackLevel;                                       // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UIGActorPerkManager*                                 OtherTarget;                                             // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       OverrideTriggerCondition;                                // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorPerkManager.ServerAddPerk
	 */
	struct UIGActorPerkManager_ServerAddPerk_Params
	{
	public:
		int32_t                                                    index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorPerkManager.OnRep_CharacterPerks
	 */
	struct UIGActorPerkManager_OnRep_CharacterPerks_Params
	{	};

	/**
	 * Function IGActorSystem.IGActorSystemHUD.IsShowMoveInformationEnbabled
	 */
	struct AIGActorSystemHUD_IsShowMoveInformationEnbabled_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorSystemHUD.IsShowMoveIndicatorsEnabled
	 */
	struct AIGActorSystemHUD_IsShowMoveIndicatorsEnabled_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorSystemHUD.IsHitboxesEnabled
	 */
	struct AIGActorSystemHUD_IsHitboxesEnabled_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorSystemLibrary.Not_InheritsFrom
	 */
	struct UIGActorSystemLibrary_Not_InheritsFrom_Params
	{
	public:
		class UObject*                                             A;                                                       // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              B;                                                       // 0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGActorSystemLibrary.Not_HasAllExactTags
	 */
	struct UIGActorSystemLibrary_Not_HasAllExactTags_Params
	{
	public:
		struct FGameplayTagContainer                               A;                                                       // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FGameplayTagContainer                               B;                                                       // 0x0020(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0040(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAIController.OnTeamInfoUpdated
	 */
	struct AIGAIController_OnTeamInfoUpdated_Params
	{	};

	/**
	 * Function IGActorSystem.IGAIController.OnFreeFallEnabled
	 */
	struct AIGAIController_OnFreeFallEnabled_Params
	{	};

	/**
	 * Function IGActorSystem.IGAIController.BPOnWakeupWindowStarted
	 */
	struct AIGAIController_BPOnWakeupWindowStarted_Params
	{	};

	/**
	 * Function IGActorSystem.IGAIController.BPOnTransitionWindowStarted
	 */
	struct AIGAIController_BPOnTransitionWindowStarted_Params
	{
	public:
		class UIGMovesetData*                                      TransitionData;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleVictimStatusNotificationBP
	 */
	struct AIGAudioHandlerActor_HandleVictimStatusNotificationBP_Params
	{
	public:
		class AActor*                                              Attacker;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              Victim;                                                  // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EQueuedAttackVictimStatus                                  Status;                                                  // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleResetAllFallSFXBP
	 */
	struct AIGAudioHandlerActor_HandleResetAllFallSFXBP_Params
	{
	public:
		class AActor*                                              Character;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleRemoteCharacterDisplaySecondsChangeAudioBP
	 */
	struct AIGAudioHandlerActor_HandleRemoteCharacterDisplaySecondsChangeAudioBP_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_EDHG[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AIGCharacter*                                        Target;                                                  // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandlePerkRemovedNotifyAudioBP
	 */
	struct AIGAudioHandlerActor_HandlePerkRemovedNotifyAudioBP_Params
	{
	public:
		struct FIGAudioPerkNotifyInfo                              EventInfo;                                               // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandlePerkGainedNotifyAudioBP
	 */
	struct AIGAudioHandlerActor_HandlePerkGainedNotifyAudioBP_Params
	{
	public:
		struct FIGAudioPerkNotifyInfo                              EventInfo;                                               // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandlePerkDeactivateNotifyAudioBP
	 */
	struct AIGAudioHandlerActor_HandlePerkDeactivateNotifyAudioBP_Params
	{
	public:
		struct FIGAudioPerkNotifyInfo                              EventInfo;                                               // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandlePerkActivateNotifyAudioBP
	 */
	struct AIGAudioHandlerActor_HandlePerkActivateNotifyAudioBP_Params
	{
	public:
		struct FIGAudioPerkNotifyInfo                              EventInfo;                                               // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleHitBlockNotificationBP
	 */
	struct AIGAudioHandlerActor_HandleHitBlockNotificationBP_Params
	{
	public:
		struct FIGAudioHitBlockEventInfo                           EventInfo;                                               // 0x0000(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleHitAnnouncementNotificationBP
	 */
	struct AIGAudioHandlerActor_HandleHitAnnouncementNotificationBP_Params
	{
	public:
		struct FIGAudioHitBlockEventInfo                           EventInfo;                                               // 0x0000(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleFallTierNotifyAudioBP
	 */
	struct AIGAudioHandlerActor_HandleFallTierNotifyAudioBP_Params
	{
	public:
		struct FIGAudioFallTierNotifyInfo                          EventInfo;                                               // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleFallEndNotifyAudioBP
	 */
	struct AIGAudioHandlerActor_HandleFallEndNotifyAudioBP_Params
	{
	public:
		class FName                                                EventName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FIGAudioFallEndNotifyInfo                           EventInfo;                                               // 0x0008(0x0020)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleAnimNotifyVoiceBP
	 */
	struct AIGAudioHandlerActor_HandleAnimNotifyVoiceBP_Params
	{
	public:
		class FName                                                EventName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FIGVoiceAnimNotifyEventInfo                         EventInfo;                                               // 0x0008(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleAnimNotifyStateEndAudioBP
	 */
	struct AIGAudioHandlerActor_HandleAnimNotifyStateEndAudioBP_Params
	{
	public:
		class FName                                                EventName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FIGAudioAnimNotifyEventInfo                         EventInfo;                                               // 0x0008(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleAnimNotifyStateBeginAudioBP
	 */
	struct AIGAudioHandlerActor_HandleAnimNotifyStateBeginAudioBP_Params
	{
	public:
		class FName                                                EventName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FIGAudioAnimNotifyEventInfo                         EventInfo;                                               // 0x0008(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.HandleAnimNotifyAudioBP
	 */
	struct AIGAudioHandlerActor_HandleAnimNotifyAudioBP_Params
	{
	public:
		class FName                                                EventName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FIGAudioAnimNotifyEventInfo                         EventInfo;                                               // 0x0008(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGAudioHandlerActor.GetGenericAudioHandler
	 */
	struct AIGAudioHandlerActor_GetGenericAudioHandler_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AIGAudioHandlerActor*                                ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.WindedStateUpdated
	 */
	struct AIGCharacter_WindedStateUpdated_Params
	{
	public:
		bool                                                       bIsWinded;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bUseZeroStamina;                                         // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.TryInteract
	 */
	struct AIGCharacter_TryInteract_Params
	{
	public:
		class UObject*                                             Target;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.TryGetCurrentMagazineMoveInfo
	 */
	struct AIGCharacter_TryGetCurrentMagazineMoveInfo_Params
	{
	public:
		class UIGMoveMontage*                                      OutMoveMontage;                                          // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EMoveTier                                                  OutMoveTier;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.StopSprintRPC
	 */
	struct AIGCharacter_StopSprintRPC_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.StopServerMoveTracking
	 */
	struct AIGCharacter_StopServerMoveTracking_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.StopScriptedMode
	 */
	struct AIGCharacter_StopScriptedMode_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.StartSprintRPC
	 */
	struct AIGCharacter_StartSprintRPC_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.StartServerMoveTracking
	 */
	struct AIGCharacter_StartServerMoveTracking_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.SetSpecialTwo
	 */
	struct AIGCharacter_SetSpecialTwo_Params
	{
	public:
		class FString                                              InName;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    InTier;                                                  // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetSpecialOne
	 */
	struct AIGCharacter_SetSpecialOne_Params
	{
	public:
		class FString                                              InName;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    InTier;                                                  // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetShouldShowDamageDebug
	 */
	struct AIGCharacter_SetShouldShowDamageDebug_Params
	{
	public:
		bool                                                       IsInCombatMode;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetScriptedWaypointMode
	 */
	struct AIGCharacter_SetScriptedWaypointMode_Params
	{
	public:
		class FString                                              TargetTag;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetScriptedFollowMode
	 */
	struct AIGCharacter_SetScriptedFollowMode_Params
	{
	public:
		class AIGCharacter*                                        FollowCharacter;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetModifiedStatBaseValue
	 */
	struct AIGCharacter_SetModifiedStatBaseValue_Params
	{
	public:
		EIGModValueType                                            ValueType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_CRHM[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      BaseValue;                                               // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetIsInCombatMode
	 */
	struct AIGCharacter_SetIsInCombatMode_Params
	{
	public:
		bool                                                       IsInCombatMode;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetInfiniteStaminaOnAuthority
	 */
	struct AIGCharacter_SetInfiniteStaminaOnAuthority_Params
	{
	public:
		bool                                                       Enabled;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetInfiniteStamina
	 */
	struct AIGCharacter_SetInfiniteStamina_Params
	{
	public:
		bool                                                       Enabled;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetInfiniteHealthOnAuthority
	 */
	struct AIGCharacter_SetInfiniteHealthOnAuthority_Params
	{
	public:
		bool                                                       Enabled;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetInfiniteHealth
	 */
	struct AIGCharacter_SetInfiniteHealth_Params
	{
	public:
		bool                                                       Enabled;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.SetDebugMoveTier
	 */
	struct AIGCharacter_SetDebugMoveTier_Params
	{
	public:
		int32_t                                                    Tier;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerStopSpeedingUpDownedTime
	 */
	struct AIGCharacter_ServerStopSpeedingUpDownedTime_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerStopServerMoveTracking
	 */
	struct AIGCharacter_ServerStopServerMoveTracking_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerStartSpeedingUpDownedTime
	 */
	struct AIGCharacter_ServerStartSpeedingUpDownedTime_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerStartServerMoveTracking
	 */
	struct AIGCharacter_ServerStartServerMoveTracking_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerSetMoveTier
	 */
	struct AIGCharacter_ServerSetMoveTier_Params
	{
	public:
		int32_t                                                    Tier;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerSetMoveExecutionParams
	 */
	struct AIGCharacter_ServerSetMoveExecutionParams_Params
	{
	public:
		struct FServerMoveExecutionParamsMsg                       ServerMoveExecutionParamsMsg;                            // 0x0000(0x0188)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerSetInfiniteStamina
	 */
	struct AIGCharacter_ServerSetInfiniteStamina_Params
	{
	public:
		bool                                                       bEnabled;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerSetInfiniteHealth
	 */
	struct AIGCharacter_ServerSetInfiniteHealth_Params
	{
	public:
		bool                                                       bEnabled;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerMoveWithParams
	 */
	struct AIGCharacter_ServerMoveWithParams_Params
	{
	public:
		float                                                      Timestamp;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize10                               InAccel;                                                 // 0x0004(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize100                              ClientLoc;                                               // 0x0010(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              CompressedMoveFlags;                                     // 0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientRoll;                                              // 0x001D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_M3OO[0x2];                                   // 0x001E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		uint32_t                                                   View;                                                    // 0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_HWR2[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UPrimitiveComponent*                                 ClientMovementBase;                                      // 0x0028(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                ClientBaseBoneName;                                      // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientMovementMode;                                      // 0x0038(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_IIXI[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FServerMoveValidationParams                         ClientParams;                                            // 0x0040(0x0030)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerMoveNoBaseWithParams
	 */
	struct AIGCharacter_ServerMoveNoBaseWithParams_Params
	{
	public:
		float                                                      Timestamp;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize10                               InAccel;                                                 // 0x0004(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize100                              ClientLoc;                                               // 0x0010(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              CompressedMoveFlags;                                     // 0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientRoll;                                              // 0x001D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_YZUO[0x2];                                   // 0x001E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		uint32_t                                                   View;                                                    // 0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientMovementMode;                                      // 0x0024(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_6WKH[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FServerMoveValidationParams                         ClientParams;                                            // 0x0028(0x0030)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerMoveDualWithParams
	 */
	struct AIGCharacter_ServerMoveDualWithParams_Params
	{
	public:
		float                                                      TimeStamp0;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize10                               InAccel0;                                                // 0x0004(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              PendingFlags;                                            // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_CYO3[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		uint32_t                                                   View0;                                                   // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Timestamp;                                               // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize10                               InAccel;                                                 // 0x001C(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize100                              ClientLoc;                                               // 0x0028(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              NewFlags;                                                // 0x0034(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientRoll;                                              // 0x0035(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_P6QA[0x2];                                   // 0x0036(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		uint32_t                                                   View;                                                    // 0x0038(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_NP6U[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UPrimitiveComponent*                                 ClientMovementBase;                                      // 0x0040(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                ClientBaseBoneName;                                      // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientMovementMode;                                      // 0x0050(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_WYK1[0x7];                                   // 0x0051(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FServerMoveValidationParams                         ClientParams;                                            // 0x0058(0x0030)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerMoveDualNoBaseWithParams
	 */
	struct AIGCharacter_ServerMoveDualNoBaseWithParams_Params
	{
	public:
		float                                                      TimeStamp0;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize10                               InAccel0;                                                // 0x0004(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              PendingFlags;                                            // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_T7HN[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		uint32_t                                                   View0;                                                   // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Timestamp;                                               // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize10                               InAccel;                                                 // 0x001C(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize100                              ClientLoc;                                               // 0x0028(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              NewFlags;                                                // 0x0034(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientRoll;                                              // 0x0035(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_QBB1[0x2];                                   // 0x0036(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		uint32_t                                                   View;                                                    // 0x0038(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientMovementMode;                                      // 0x003C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_QNUW[0x3];                                   // 0x003D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FServerMoveValidationParams                         ClientParams;                                            // 0x0040(0x0030)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerMoveDualHybridRootMotionWithParams
	 */
	struct AIGCharacter_ServerMoveDualHybridRootMotionWithParams_Params
	{
	public:
		float                                                      TimeStamp0;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize10                               InAccel0;                                                // 0x0004(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              PendingFlags;                                            // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_BRM7[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		uint32_t                                                   View0;                                                   // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Timestamp;                                               // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize10                               InAccel;                                                 // 0x001C(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize100                              ClientLoc;                                               // 0x0028(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              NewFlags;                                                // 0x0034(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientRoll;                                              // 0x0035(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_QS16[0x2];                                   // 0x0036(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		uint32_t                                                   View;                                                    // 0x0038(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_4I4G[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UPrimitiveComponent*                                 ClientMovementBase;                                      // 0x0040(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                ClientBaseBoneName;                                      // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ClientMovementMode;                                      // 0x0050(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_LA4K[0x7];                                   // 0x0051(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FServerMoveValidationParams                         ClientParams;                                            // 0x0058(0x0030)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerDumpServerMoveTracking
	 */
	struct AIGCharacter_ServerDumpServerMoveTracking_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerDebugClearStackFloatsAllPlayers
	 */
	struct AIGCharacter_ServerDebugClearStackFloatsAllPlayers_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.ServerApplyLoadout
	 */
	struct AIGCharacter_ServerApplyLoadout_Params
	{
	public:
		class FName                                                LoadoutName;                                             // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.Respawn
	 */
	struct AIGCharacter_Respawn_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.ResetMoveTier
	 */
	struct AIGCharacter_ResetMoveTier_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.ResetCharacterTransition
	 */
	struct AIGCharacter_ResetCharacterTransition_Params
	{
	public:
		class UIGGenericInputEvent*                                InEvent;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    AdditionalDurationMS;                                    // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.PostNetReceiveRole
	 */
	struct AIGCharacter_PostNetReceiveRole_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.PocketSwap
	 */
	struct AIGCharacter_PocketSwap_Params
	{
	public:
		class UObject*                                             Target;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.PlaySoundForOwnership
	 */
	struct AIGCharacter_PlaySoundForOwnership_Params
	{
	public:
		class USoundBase*                                          Sound;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             Location;                                                // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                                            Rotation;                                                // 0x0014(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		float                                                      VolumeMultiplier;                                        // 0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      PitchMultiplier;                                         // 0x0024(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      StartTime;                                               // 0x0028(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_YNEX[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class USoundAttenuation*                                   AttenuationSettings;                                     // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class USoundConcurrency*                                   ConcurrencySettings;                                     // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OwningActor;                                             // 0x0040(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.OverrideStaminaRegenValues
	 */
	struct AIGCharacter_OverrideStaminaRegenValues_Params
	{
	public:
		float                                                      InStaminaRegenRate;                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      InStaminaRegenCooldown;                                  // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.OverrideMinStamina
	 */
	struct AIGCharacter_OverrideMinStamina_Params
	{
	public:
		bool                                                       bShouldOverride;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_HLAF[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      NewMinStamina;                                           // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.OrientToSurface
	 */
	struct AIGCharacter_OrientToSurface_Params
	{
	public:
		struct FVector                                             surfaceNormal;                                           // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction IGActorSystem.IGCharacter.OnWinded__DelegateSignature
	 */
	struct AIGCharacter_OnWinded__DelegateSignature_Params
	{
	public:
		float                                                      StaminaPercentage;                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction IGActorSystem.IGCharacter.OnSwingingMovementExited__DelegateSignature
	 */
	struct AIGCharacter_OnSwingingMovementExited__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction IGActorSystem.IGCharacter.OnSwingingMovementEntered__DelegateSignature
	 */
	struct AIGCharacter_OnSwingingMovementEntered__DelegateSignature_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_WantsToBlock
	 */
	struct AIGCharacter_OnRep_WantsToBlock_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_Stamina
	 */
	struct AIGCharacter_OnRep_Stamina_Params
	{
	public:
		float                                                      OldStamina;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_ReplicatedTargetingInfo
	 */
	struct AIGCharacter_OnRep_ReplicatedTargetingInfo_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_ReplicatedMoveMontage
	 */
	struct AIGCharacter_OnRep_ReplicatedMoveMontage_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_ReplicatedFame
	 */
	struct AIGCharacter_OnRep_ReplicatedFame_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_MapZoneId
	 */
	struct AIGCharacter_OnRep_MapZoneId_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_IsSuperstarModeActive
	 */
	struct AIGCharacter_OnRep_IsSuperstarModeActive_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_IsInCombatMode
	 */
	struct AIGCharacter_OnRep_IsInCombatMode_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_IsDBNO
	 */
	struct AIGCharacter_OnRep_IsDBNO_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_IGMovementInfo
	 */
	struct AIGCharacter_OnRep_IGMovementInfo_Params
	{	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_Health
	 */
	struct AIGCharacter_OnRep_Health_Params
	{
	public:
		float                                                      OldHealth;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IGActorSystem.IGCharacter.OnRep_DownedTimeLeftChanged
	 */
	struct AIGCharacter_OnRep_DownedTimeLeftChanged_Params
	{	};

	/**
