#pragma once

/**
 * Name: Rumbleverse
 * Version: Latest
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum IGActorSystem.EIGItemType
	 */
	enum class EIGItemType : uint8_t
	{
		None     = 0,
		Weapon   = 1,
		Health   = 2,
		Stamina  = 3,
		Fame     = 4,
		Magazine = 5,
		Arms     = 6,
		Core     = 7,
		Legs     = 8,
		MAX      = 9
	};

	/**
	 * Enum IGActorSystem.EMoveTier
	 */
	enum class EMoveTier : uint8_t
	{
		EMT_Tier1 = 0,
		EMT_Tier2 = 1,
		EMT_Tier3 = 2,
		EMT_MAX   = 3
	};

	/**
	 * Enum IGActorSystem.EIGSpecialMoveEffect
	 */
	enum class EIGSpecialMoveEffect : uint8_t
	{
		None            = 0,
		Stun            = 1,
		Blast           = 2,
		Poison          = 3,
		Burn            = 4,
		Blind           = 5,
		Carry           = 6,
		Freeze          = 7,
		Magnetic        = 8,
		Charge          = 9,
		Cold            = 10,
		Invulnerability = 11,
		Aim             = 12,
		FallPowerUp     = 13,
		Unblockable     = 14,
		HighPriority    = 15,
		MAX             = 16
	};

	/**
	 * Enum IGActorSystem.EIGInventorySlot
	 */
	enum class EIGInventorySlot : uint8_t
	{
		HandSlot   = 0,
		LeftSlot   = 1,
		UpSlot     = 2,
		RightSlot  = 3,
		DownSlot   = 4,
		SLOT_COUNT = 5,
		MAX        = 6
	};

	/**
	 * Enum IGActorSystem.EKnockoutType
	 */
	enum class EKnockoutType : uint8_t
	{
		ETKO       = 0,
		EKnockdown = 1,
		EPin       = 2,
		ERingOut   = 3,
		MAX        = 4
	};

	/**
	 * Enum IGActorSystem.EIGModValueType
	 */
	enum class EIGModValueType : uint8_t
	{
		MaxHealth                           = 0,
		MaxStamina                          = 1,
		AttackPower                         = 2,
		MaxClimbingSpeed                    = 3,
		StaminaRegen                        = 4,
		StaminaWindedRegen                  = 5,
		StaminaRegenCooldown                = 6,
		MaxWalkSpeed                        = 7,
		MaxAccelerationSpeed                = 8,
		JumpHeight                          = 9,
		DisplacementStateVelocityMultiplier = 10,
		MaxFame                             = 11,
		MAX                                 = 12
	};

	/**
	 * Enum IGActorSystem.EMatchTeamMode
	 */
	enum class EMatchTeamMode : uint8_t
	{
		MTM_Invalid = 0,
		MTM_Solo    = 1,
		MTM_Duo     = 2,
		MTM_Trio    = 3,
		MTM_Quad    = 4,
		MTM_MAX     = 5
	};

	/**
	 * Enum IGActorSystem.EIGAchievementStatProgressionType
	 */
	enum class EIGAchievementStatProgressionType : uint8_t
	{
		None        = 0,
		Progressive = 1,
		Maximum     = 2,
		MAX         = 3
	};

	/**
	 * Enum IGActorSystem.EIGAchievement
	 */
	enum class EIGAchievement : uint8_t
	{
		IGA_NONE                = 0,
		IGA_Target1             = 1,
		IGA_Target5             = 2,
		IGA_Target10            = 3,
		IGA_Target20            = 4,
		IGA_Target50            = 5,
		IGA_Target100_Hidden    = 6,
		IGA_Binary1             = 7,
		IGA_Binary2_Hidden      = 8,
		IGA_DirtyDinner         = 9,
		IGA_GrapitalCitySpecial = 10,
		IGA_ViciousBeatsBlock   = 11,
		IGA_BlockBeatsStrike    = 12,
		IGA_CrossingGuard       = 13,
		IGA_MoveableFeast       = 14,
		IGA_MomentOfTruth       = 15,
		IGA_BigHit              = 16,
		IGA_ExtraSpecial        = 17,
		IGA_Elimination         = 18,
		IGA_EyeOfAHawk          = 19,
		IGA_Sportsfriends       = 20,
		IGA_Count               = 21,
		IGA_MAX                 = 22
	};

	/**
	 * Enum IGActorSystem.EIGClashPriorityTier
	 */
	enum class EIGClashPriorityTier : uint8_t
	{
		LowestPriority  = 0,
		GrappleStart    = 1,
		GrappleSpecial  = 2,
		Strike          = 3,
		StrikeSpecial   = 4,
		Weapon          = 5,
		Power           = 6,
		Super           = 7,
		HighestPriority = 8,
		MAX             = 9
	};

	/**
	 * Enum IGActorSystem.EIGUnpocketStatus
	 */
	enum class EIGUnpocketStatus : uint8_t
	{
		DidntAttemptUnpocket = 0,
		UnpocketedNothing    = 1,
		UnpocketedSomething  = 2,
		MAX                  = 3
	};

	/**
	 * Enum IGActorSystem.EQueuedAttackVictimStatus
	 */
	enum class EQueuedAttackVictimStatus : uint8_t
	{
		Normal = 0,
		KO     = 1,
		TKO    = 2,
		Clash  = 3,
		OTG    = 4,
		MAX    = 5
	};

	/**
	 * Enum IGActorSystem.EQueuedAttackResult
	 */
	enum class EQueuedAttackResult : uint8_t
	{
		RESULT_HitBlock = 0,
		RESULT_Hit      = 1,
		RESULT_Block    = 2,
		RESULT_Clash    = 3,
		RESULT_Whiff    = 4,
		RESULT_OTGHit   = 5,
		RESULT_MAX      = 6
	};

	/**
	 * Enum IGActorSystem.EQueuedAttackStatus
	 */
	enum class EQueuedAttackStatus : uint8_t
	{
		STATUS_Pending = 0,
		STATUS_Locked  = 1,
		STATUS_Expired = 2,
		STATUS_MAX     = 3
	};

	/**
	 * Enum IGActorSystem.EAttackCancelStatus
	 */
	enum class EAttackCancelStatus : uint8_t
	{
		ACS_Initial = 0,
		ACS_Blocked = 1,
		ACS_Hit     = 2,
		ACS_MAX     = 3
	};

	/**
	 * Enum IGActorSystem.ETargetingStatus
	 */
	enum class ETargetingStatus : uint8_t
	{
		TSTATUS_Off       = 0,
		TSTATUS_Searching = 1,
		TSTATUS_Found     = 2,
		TSTATUS_Lost      = 3,
		TSTATUS_MAX       = 4
	};

	/**
	 * Enum IGActorSystem.EGuidType
	 */
	enum class EGuidType : uint8_t
	{
		ENewId    = 0,
		EVictimId = 1,
		EInputId  = 2,
		EEventId  = 3,
		MAX       = 4
	};

	/**
	 * Enum IGActorSystem.EFallDamageSource
	 */
	enum class EFallDamageSource : uint8_t
	{
		None                  = 0,
		PlatformingFall       = 1,
		AerialAttackWhiffFall = 2,
		MAX                   = 3
	};

	/**
	 * Enum IGActorSystem.EIGJumpType
	 */
	enum class EIGJumpType : uint8_t
	{
		None        = 0,
		Standard    = 1,
		Boost       = 2,
		Long        = 3,
		SideFlip    = 4,
		OverFlip    = 5,
		WallJump    = 6,
		OffWall     = 7,
		Springboard = 8,
		MAX         = 9
	};

	/**
	 * Enum IGActorSystem.EIGCauseOfPickupDrop
	 */
	enum class EIGCauseOfPickupDrop : uint8_t
	{
		Undefined  = 0,
		BeingHit   = 1,
		PlayerDrop = 2,
		Thrown     = 3,
		DropSwap   = 4,
		Emote      = 5,
		ForcedDrop = 6,
		MAX        = 7
	};

	/**
	 * Enum IGActorSystem.EIGModType
	 */
	enum class EIGModType : uint8_t
	{
		Add      = 0,
		Mult     = 1,
		Override = 2,
		MAX      = 3
	};

	/**
	 * Enum IGActorSystem.EMoveTrack
	 */
	enum class EMoveTrack : uint8_t
	{
		None                   = 0,
		MoveTrack1             = 1,
		MoveTrack2             = 2,
		MoveTrack3             = 3,
		MoveTrack4             = 4,
		MoveTrack5             = 5,
		MoveTrack6             = 6,
		MoveTrack7             = 7,
		MoveTrack8             = 8,
		MoveTrack9             = 9,
		MoveTrack10            = 10,
		MoveTrack11            = 11,
		MoveTrack12            = 12,
		MoveTrack13            = 13,
		MoveTrack14            = 14,
		MoveTrack15            = 15,
		LastConfirmedMoveTrack = 16,
		ForcedMoveTrack        = 17,
		MAX                    = 18
	};

	/**
	 * Enum IGActorSystem.EIGWeaponType
	 */
	enum class EIGWeaponType : uint8_t
	{
		None           = 0,
		SingleHanded   = 1,
		Paddle         = 2,
		Overhead       = 3,
		ConsumableItem = 4,
		MAX            = 5
	};

	/**
	 * Enum IGActorSystem.EIGDownedReactionType
	 */
	enum class EIGDownedReactionType : uint8_t
	{
		None   = 0,
		Light  = 1,
		Medium = 2,
		Heavy  = 3,
		MAX    = 4
	};

	/**
	 * Enum IGActorSystem.ECauseOfDeath
	 */
	enum class ECauseOfDeath : uint8_t
	{
		COD_Undefined        = 0,
		COD_Damage           = 1,
		COD_FallOutOfWorld   = 2,
		COD_Pin              = 3,
		COD_RingOut          = 4,
		COD_DownedTimeOut    = 5,
		COD_WaterInstantKill = 6,
		COD_Disconnected     = 7,
		COD_Debug            = 8,
		COD_MAX              = 9
	};

	/**
	 * Enum IGActorSystem.EFameSource
	 */
	enum class EFameSource : uint8_t
	{
		FS_Damage_Attacker   = 0,
		FS_Damage_Victim     = 1,
		FS_KO                = 2,
		FS_TKO               = 3,
		FS_Pin               = 4,
		FS_Clash             = 5,
		FS_TeammateRescue    = 6,
		FS_NonTeammateRescue = 7,
		FS_Event             = 8,
		FS_TauntStart        = 9,
		FS_TauntTick         = 10,
		FS_TauntFinish       = 11,
		FS_TauntFailed       = 12,
		FS_PinKickout        = 13,
		FS_SpeedUpDownedTime = 14,
		FS_Special           = 15,
		FS_SpecialTick       = 16,
		FS_Collectible       = 17,
		FS_Superstar_Drain   = 18,
		FS_Superstar_Special = 19,
		FS_KOInsurance       = 20,
		FS_Consumable        = 21,
		FS_DropFame          = 22,
		FS_Debug             = 23,
		FS_MAX               = 24
	};

	/**
	 * Enum IGActorSystem.ECharacterLocomotionState
	 */
	enum class ECharacterLocomotionState : uint8_t
	{
		Any                     = 0,
		GroundMovement          = 1,
		InAir                   = 2,
		GroundSprint            = 3,
		Climbing                = 4,
		AllGround               = 5,
		LedgeMount              = 6,
		JumpStartNoInputAllowed = 7,
		ForcedFall              = 8,
		ClimbingDash            = 9,
		CannonShot              = 10,
		FreeFall                = 11,
		Hitstop                 = 12,
		Swinging                = 13,
		AllClimbing             = 14,
		NotSwinging             = 15,
		None                    = 16,
		MAX                     = 17
	};

	/**
	 * Enum IGActorSystem.EAudioSelection
	 */
	enum class EAudioSelection : uint8_t
	{
		AS_TypeOne   = 0,
		AS_TypeTwo   = 1,
		AS_TypeThree = 2,
		AS_TypeFour  = 3,
		AS_TypeFive  = 4,
		AS_TypeSix   = 5,
		AS_Count     = 6,
		AS_MAX       = 7
	};

	/**
	 * Enum IGActorSystem.EComboLimitFlags
	 */
	enum class EComboLimitFlags : uint8_t
	{
		Stagger    = 0,
		Wallbounce = 1,
		Custom3    = 2,
		Custom4    = 3,
		Custom5    = 4,
		Custom6    = 5,
		Custom7    = 6,
		Custom8    = 7,
		Custom9    = 8,
		Custom10   = 9,
		Custom11   = 10,
		Custom12   = 11,
		Custom13   = 12,
		Custom14   = 13,
		Custom15   = 14,
		Custom16   = 15,
		MAX        = 16
	};

	/**
	 * Enum IGActorSystem.EExecuteMoveType
	 */
	enum class EExecuteMoveType : uint8_t
	{
		EM_ClientTriggered = 0,
		EM_ServerTriggered = 1,
		EM_ServerConfirmed = 2,
		EM_ClientConfirmed = 3,
		EM_MAX             = 4
	};

	/**
	 * Enum IGActorSystem.EEmoteSlot
	 */
	enum class EEmoteSlot : uint8_t
	{
		None       = 0,
		EmoteSlot1 = 1,
		EmoteSlot2 = 2,
		EmoteSlot3 = 3,
		EmoteSlot4 = 4,
		EmoteSlot5 = 5,
		EmoteSlot6 = 6,
		EmoteSlot7 = 7,
		EmoteSlot8 = 8,
		Count      = 9,
		MAX        = 10
	};

	/**
	 * Enum IGActorSystem.EBattlePassRewardType
	 */
	enum class EBattlePassRewardType : uint8_t
	{
		None                 = 0,
		FanBooster           = 1,
		VirtualCurrency      = 2,
		Emote                = 3,
		HeadAccessory        = 4,
		MiscHeadAccessory    = 5,
		TorsoAccessory       = 6,
		MiscTorsoAccessory   = 7,
		HandsAccessory       = 8,
		LegsAccessory        = 9,
		MiscLegsAccessory    = 10,
		FeetAccessory        = 11,
		HairAccessory        = 12,
		ElbowsAccessory      = 13,
		KneesAccessory       = 14,
		FacialHairAccessory  = 15,
		TitleCardPlayerTitle = 16,
		TitleCardMedal       = 17,
		TitleCardStat        = 18,
		TitleCardPlayerPose  = 19,
		TitleCardBackground  = 20,
		TitleCardBorder      = 21,
		MAX                  = 22
	};

	/**
	 * Enum IGActorSystem.EIGWalletAssetType
	 */
	enum class EIGWalletAssetType : uint8_t
	{
		WAT_Accessory        = 0,
		WAT_Tattoo           = 1,
		WAT_Makeup           = 2,
		WAT_Emote            = 3,
		WAT_BodyShape        = 4,
		WAT_SkinColor        = 5,
		WAT_HeadShape        = 6,
		WAT_EyeColor         = 7,
		WAT_Eyebrow          = 8,
		WAT_VirtualCurrency  = 9,
		WAT_BattlePass       = 10,
		WAT_TitleCardReward  = 11,
		WAT_FeatureOwnership = 12,
		WAT_MAX              = 13
	};

	/**
	 * Enum IGActorSystem.EIGSeasonIdentifier
	 */
	enum class EIGSeasonIdentifier : uint8_t
	{
		ESI_None               = 0,
		ESI_Season1            = 1,
		ESI_Season1BpOverride  = 2,
		ESI_Season2            = 3,
		ESI_Season2BpOverride  = 4,
		ESI_Season3            = 5,
		ESI_Season3BpOverride  = 6,
		ESI_Season4            = 7,
		ESI_Season4BpOverride  = 8,
		ESI_Season5            = 9,
		ESI_Season5BpOverride  = 10,
		ESI_Season6            = 11,
		ESI_Season6BpOverride  = 12,
		ESI_Season7            = 13,
		ESI_Season7BpOverride  = 14,
		ESI_Season8            = 15,
		ESI_Season8BpOverride  = 16,
		ESI_Season9            = 17,
		ESI_Season9BpOverride  = 18,
		ESI_Season10           = 19,
		ESI_Season10BpOverride = 20,
		ESI_Season11           = 21,
		ESI_Season11BpOverride = 22,
		ESI_Season12           = 23,
		ESI_Season12BpOverride = 24,
		ESI_Season13           = 25,
		ESI_Season13BpOverride = 26,
		ESI_Season14           = 27,
		ESI_Season14BpOverride = 28,
		ESI_Season15           = 29,
		ESI_Season15BpOverride = 30,
		ESI_Season16           = 31,
		ESI_Season16BpOverride = 32,
		ESI_Season17           = 33,
		ESI_Season17BpOverride = 34,
		ESI_Season18           = 35,
		ESI_Season18BpOverride = 36,
		ESI_Season19           = 37,
		ESI_Season19BpOverride = 38,
		ESI_Season20           = 39,
		ESI_Season20BpOverride = 40,
		ESI_Season21           = 41,
		ESI_Season21BpOverride = 42,
		ESI_Season22           = 43,
		ESI_Season22BpOverride = 44,
		ESI_Max                = 45
	};

	/**
	 * Enum IGActorSystem.EIGFlavorEntitlements
	 */
	enum class EIGFlavorEntitlements : uint8_t
	{
		FE_None       = 0,
		FE_FlavorSet1 = 1,
		FE_FlavorSet2 = 2,
		FE_FlavorSet3 = 3,
		FE_MAX        = 4
	};

	/**
	 * Enum IGActorSystem.EIGStarterSetEntitlement
	 */
	enum class EIGStarterSetEntitlement : uint8_t
	{
		SSE_None        = 0,
		SSE_StarterSet1 = 1,
		SSE_StarterSet2 = 2,
		SSE_StarterSet3 = 3,
		SSE_StarterSet4 = 4,
		SSE_StarterSet5 = 5,
		SSE_StarterSet6 = 6,
		SSE_MAX         = 7
	};

	/**
	 * Enum IGActorSystem.EAccessoryItemRarity
	 */
	enum class EAccessoryItemRarity : uint8_t
	{
		EAIR_Tier1 = 0,
		EAIR_Tier2 = 1,
		EAIR_Tier3 = 2,
		EAIR_Tier4 = 3,
		EAIR_MAX   = 4
	};

	/**
	 * Enum IGActorSystem.EIGSkinZones
	 */
	enum class EIGSkinZones : uint8_t
	{
		NONE = 0,
		SZ   = 1,
		SZ01 = 2,
		SZ02 = 3,
		SZ03 = 4,
		SZ04 = 5,
		SZ05 = 6,
		SZ06 = 7,
		SZ07 = 8,
		SZ08 = 9,
		SZ09 = 10,
		SZ10 = 11,
		SZ11 = 12,
		SZ12 = 13,
		SZ13 = 14,
		SZ14 = 15,
		SZ15 = 16,
		SZ16 = 17,
		SZ17 = 18,
		SZ18 = 19,
		SZ19 = 20,
		SZ20 = 21,
		SZ21 = 22,
		SZ22 = 23,
		SZ23 = 24,
		SZ24 = 25,
		SZ25 = 26,
		MAX  = 27
	};

	/**
	 * Enum IGActorSystem.EIGBodyRegion
	 */
	enum class EIGBodyRegion : uint8_t
	{
		EIGBR_None       = 0,
		EIGBR_FullBody   = 1,
		EIGBR_Head       = 2,
		EIGBR_Body       = 3,
		EIGBR_Torso      = 4,
		EIGBR_Elbow      = 5,
		EIGBR_Hands      = 6,
		EIGBR_Hip        = 7,
		EIGBR_LowerBody  = 8,
		EIGBR_Thigh      = 9,
		EIGBR_Knee       = 10,
		EIGBR_Feet       = 11,
		EIGBR_Hair       = 12,
		EIGBR_FacialHair = 13,
		EIGBR_UpperArm   = 14,
		EIGBR_Forearm    = 15,
		EIGBR_Calves     = 16,
		EIGBR_Abdomen    = 17,
		EIGBR_Count      = 18,
		EIGBR_MAX        = 19
	};

	/**
	 * Enum IGActorSystem.EIGRegion
	 */
	enum class EIGRegion : uint8_t
	{
		RG_R1    = 0,
		RG_R2    = 1,
		RG_R3    = 2,
		RG_R4    = 3,
		RG_R5    = 4,
		RG_SR1   = 5,
		RG_SR2   = 6,
		RG_SR3   = 7,
		RG_SR4   = 8,
		RG_SR5   = 9,
		RG_SR6   = 10,
		RG_SR7   = 11,
		RG_SR8   = 12,
		RG_SR9   = 13,
		RG_SR10  = 14,
		RG_Count = 15,
		RG_MAX   = 16
	};

	/**
	 * Enum IGActorSystem.EIGTextureAccessoryType
	 */
	enum class EIGTextureAccessoryType : uint8_t
	{
		TAT_None     = 0,
		TAT_Makeup   = 1,
		TAT_Tattoo   = 2,
		TAT_EyeColor = 3,
		TAT_Eyebrow  = 4,
		TAT_MAX      = 5
	};

	/**
	 * Enum IGActorSystem.EIGBodyType
	 */
	enum class EIGBodyType : uint8_t
	{
		BT_Alfa    = 0,
		BT_Bravo   = 1,
		BT_Charlie = 2,
		BT_Delta   = 3,
		BT_Echo    = 4,
		BT_Foxtrot = 5,
		BT_MAX     = 6
	};

	/**
	 * Enum IGActorSystem.EIGAchievementError
	 */
	enum class EIGAchievementError : uint8_t
	{
		WriteProgressToFile = 0,
		UpdateAchievement   = 1,
		GetAchievements     = 2,
		MAX                 = 3
	};

	/**
	 * Enum IGActorSystem.DamageModifierType
	 */
	enum class EDamageModifierType : uint8_t
	{
		DamageModifierTypeIncoming               = 0,
		DamageModifierTypeOutgoing_NonWeapon     = 1,
		DamageModifierTypeOutgoing_Weapons       = 2,
		DamageModifierTypeDamageModifierType_MAX = 3
	};

	/**
	 * Enum IGActorSystem.PerkActivationType
	 */
	enum class EPerkActivationType : uint8_t
	{
		PerkActivationTypeConstant_Effect        = 0,
		PerkActivationTypeHolding_Still          = 1,
		PerkActivationTypeElimination_Scored     = 2,
		PerkActivationTypeStat_Increased         = 3,
		PerkActivationTypeHealth_Threshold       = 4,
		PerkActivationTypeStamina_Threshold      = 5,
		PerkActivationTypeDamage_Taken           = 6,
		PerkActivationTypeDamage_Dealt           = 7,
		PerkActivationTypeDelayed_Warmup_OneShot = 8,
		PerkActivationTypeTaunt_Near_Enemy       = 9,
		PerkActivationTypeExit_Idling            = 10,
		PerkActivationTypeCanMeditate            = 11,
		PerkActivationTypeCannotMeditate         = 12,
		PerkActivationTypeFameCollected          = 13,
		PerkActivationTypePerkActivationType_MAX = 14
	};

	/**
	 * Enum IGActorSystem.StaminaReductionType
	 */
	enum class EStaminaReductionType : uint8_t
	{
		StaminaReductionTypeExecute_Move             = 0,
		StaminaReductionTypeClimbing_Idle            = 1,
		StaminaReductionTypeClimbing_Moving          = 2,
		StaminaReductionTypeJump                     = 3,
		StaminaReductionTypeStaminaReductionType_MAX = 4
	};

	/**
	 * Enum IGActorSystem.ESweepCastShape
	 */
	enum class ESweepCastShape : uint8_t
	{
		Line    = 0,
		Sphere  = 1,
		Capsule = 2,
		Box     = 3,
		MAX     = 4
	};

	/**
	 * Enum IGActorSystem.EIGGrappleSyncStrategy
	 */
	enum class EIGGrappleSyncStrategy : uint8_t
	{
		EGSS_None              = 0,
		EGSS_ForceSyncAttacker = 1,
		EGSS_MAX               = 2
	};

	/**
	 * Enum IGActorSystem.EContextActionType
	 */
	enum class EContextActionType : uint8_t
	{
		Default    = 0,
		ItemPickup = 1,
		ItemDrop   = 2,
		Climbing   = 3,
		Swinging   = 4,
		MAX        = 5
	};

	/**
	 * Enum IGActorSystem.EIGCollectibleState
	 */
	enum class EIGCollectibleState : uint8_t
	{
		DISABLED       = 0,
		UNCOLLECTED    = 1,
		VANISH_WARNING = 2,
		COLLECTED      = 3,
		VANISHED       = 4,
		MAX            = 5
	};

	/**
	 * Enum IGActorSystem.EFallTierNotifyType
	 */
	enum class EFallTierNotifyType : uint8_t
	{
		Platforming = 0,
		Grapple     = 1,
		Launcher    = 2,
		MAX         = 3
	};

	/**
	 * Enum IGActorSystem.EIGGrenadeState
	 */
	enum class EIGGrenadeState : uint8_t
	{
		Disabled              = 0,
		Available             = 1,
		DetonateCountDown     = 2,
		DetonateTimerFinished = 3,
		Detonated             = 4,
		FinishedLingering     = 5,
		MAX                   = 6
	};

	/**
	 * Enum IGActorSystem.ETargetPriority
	 */
	enum class ETargetPriority : uint8_t
	{
		TP_Lowest  = 0,
		TP_Lower   = 1,
		TP_Medium  = 2,
		TP_Higher  = 3,
		TP_Highest = 4,
		TP_MAX     = 5
	};

	/**
	 * Enum IGActorSystem.EReceiptResult
	 */
	enum class EReceiptResult : uint8_t
	{
		RECEIPT_Hit       = 0,
		RECEIPT_Blocked   = 1,
		RECEIPT_Clash     = 2,
		RECEIPT_Whiffed   = 3,
		RECEIPT_Finalized = 4,
		RECEIPT_ThrownOut = 5,
		RECEIPT_MAX       = 6
	};

	/**
	 * Enum IGActorSystem.EHeldItemBehavior
	 */
	enum class EHeldItemBehavior : uint8_t
	{
		PocketOrDrop = 0,
		AlwaysDrop   = 1,
		KeepHeld     = 2,
		MAX          = 3
	};

	/**
	 * Enum IGActorSystem.EInteractablePromptBehavior
	 */
	enum class EInteractablePromptBehavior : uint8_t
	{
		PROMPT_UseSafeZone           = 0,
		PROMPT_AlwaysStickToLocation = 1,
		PROMPT_MAX                   = 2
	};

	/**
	 * Enum IGActorSystem.EIGStashabilityType
	 */
	enum class EIGStashabilityType : uint8_t
	{
		Unstashable = 0,
		Regular     = 1,
		Large       = 2,
		MAX         = 3
	};

	/**
	 * Enum IGActorSystem.EIGDurabilityChangeType
	 */
	enum class EIGDurabilityChangeType : uint8_t
	{
		Hit   = 0,
		Spawn = 1,
		MAX   = 2
	};

	/**
	 * Enum IGActorSystem.EIGStashType
	 */
	enum class EIGStashType : uint8_t
	{
		Normal     = 0,
		AutoPocket = 1,
		MAX        = 2
	};

	/**
	 * Enum IGActorSystem.EIGInteractionType
	 */
	enum class EIGInteractionType : uint8_t
	{
		StartInteract = 0,
		StopInteract  = 1,
		Use           = 2,
		MAX           = 3
	};

	/**
	 * Enum IGActorSystem.EModuleLootState
	 */
	enum class EModuleLootState : uint8_t
	{
		MLS_Unlootable = 0,
		MLS_Lootable   = 1,
		MLS_Looted     = 2,
		MLS_MAX        = 3
	};

	/**
	 * Enum IGActorSystem.EIGSpawnerState
	 */
	enum class EIGSpawnerState : uint8_t
	{
		INACTIVE        = 0,
		INITIALIZED     = 1,
		INCOMINGWARNING = 2,
		SPAWNED         = 3,
		MAX             = 4
	};

	/**
	 * Enum IGActorSystem.EAllowedAction
	 */
	enum class EAllowedAction : uint8_t
	{
		Climbing     = 0,
		Swinging     = 1,
		Resurrection = 2,
		MAX          = 3
	};

	/**
	 * Enum IGActorSystem.ETransitionCheckResult
	 */
	enum class ETransitionCheckResult : uint8_t
	{
		Fail_Misc    = 0,
		Fail_Stamina = 1,
		Fail_Fame    = 2,
		Success      = 3,
		MAX          = 4
	};

	/**
	 * Enum IGActorSystem.EBufferPairFindType
	 */
	enum class EBufferPairFindType : uint8_t
	{
		None        = 0,
		Both        = 1,
		PressOnly   = 2,
		ReleaseOnly = 3,
		MAX         = 4
	};

	/**
	 * Enum IGActorSystem.EIGAimType
	 */
	enum class EIGAimType : uint8_t
	{
		EAT_Weapon = 0,
		EAT_Ping   = 1,
		EAT_COUNT  = 2,
		EAT_MAX    = 3
	};

	/**
	 * Enum IGActorSystem.EIGCombatContextBehavior
	 */
	enum class EIGCombatContextBehavior : uint8_t
	{
		Default     = 0,
		Toggle      = 1,
		AutoCombo_X = 2,
		AutoCombo_Y = 3,
		MAX         = 4
	};

	/**
	 * Enum IGActorSystem.EFallingType
	 */
	enum class EFallingType : uint8_t
	{
		Platforming = 0,
		Grapple     = 1,
		Launcher    = 2,
		AirToGround = 3,
		MAX         = 4
	};

	/**
	 * Enum IGActorSystem.EServerMoveType
	 */
	enum class EServerMoveType : uint8_t
	{
		ENewMove     = 0,
		EOldMove     = 1,
		EPendingMove = 2,
		MAX          = 3
	};

	/**
	 * Enum IGActorSystem.EIGReactionEndLocationType
	 */
	enum class EIGReactionEndLocationType : uint8_t
	{
		Standing      = 0,
		LyingFaceUp   = 1,
		LyingFaceDown = 2,
		MAX           = 3
	};

	/**
	 * Enum IGActorSystem.EIGIventoryDropType
	 */
	enum class EIGIventoryDropType : uint8_t
	{
		None        = 0,
		All         = 1,
		Half        = 2,
		Random      = 3,
		Knockdown   = 4,
		Elimination = 5,
		MAX         = 6
	};

	/**
	 * Enum IGActorSystem.EMoveInputDirection
	 */
	enum class EMoveInputDirection : uint8_t
	{
		Any          = 0,
		Up           = 1,
		Down         = 2,
		Left         = 3,
		Right        = 4,
		UpRight      = 5,
		UpLeft       = 6,
		DownRight    = 7,
		DownLeft     = 8,
		Neutral      = 9,
		AnyDirection = 10,
		MAX          = 11
	};

	/**
	 * Enum IGActorSystem.EMoveTransitionEvents
	 */
	enum class EMoveTransitionEvents : uint8_t
	{
		None                                     = 0,
		MoveEnded                                = 1,
		MoveEnded_BackKnockout                   = 2,
		MoveEnded_StandingKnockout               = 3,
		MoveEnded_BackDeath                      = 4,
		MoveEnded_StandingDeath                  = 5,
		BattleRoyale_TagTeam_LaunchEnded         = 6,
		BattleRoyale_TagTeam_GainedLaunchControl = 7,
		Interrupted                              = 8,
		RaycastHit                               = 9,
		Airborne                                 = 10,
		Grounded                                 = 11,
		WeaponBreak                              = 12,
		MAX                                      = 13
	};

	/**
	 * Enum IGActorSystem.EInputStateType
	 */
	enum class EInputStateType : uint8_t
	{
		Pressed                  = 0,
		Released                 = 1,
		DoublePressedUNSUPPORTED = 2,
		Hold                     = 3,
		HoldOrPress              = 4,
		Any                      = 5,
		NotHeld                  = 6,
		MAX                      = 7
	};

	/**
	 * Enum IGActorSystem.EIGMoveType
	 */
	enum class EIGMoveType : uint8_t
	{
		None                 = 0,
		Strike               = 1,
		GrappleStart         = 2,
		GrappleFollowThrough = 3,
		StrikeSpecial        = 4,
		GrappleSpecial       = 5,
		Reaction             = 6,
		Traversal            = 7,
		Emote                = 8,
		Weapon               = 9,
		ChargeRelease        = 10,
		WeaponChargeRelease  = 11,
		Block                = 12,
		DropKick             = 13,
		Uppercut             = 14,
		Super                = 15,
		BotMove              = 16,
		MAX                  = 17
	};

	/**
	 * Enum IGActorSystem.EStatDamageType
	 */
	enum class EStatDamageType : uint8_t
	{
		ESDT_None        = 0,
		ESDT_Core        = 1,
		ESDT_Arms        = 2,
		ESDT_Legs        = 3,
		ESDT_CoreAndArms = 4,
		ESDT_CoreAndLegs = 5,
		ESDT_ArmsAndLegs = 6,
		ESDT_All         = 7,
		ESDT_MAX         = 8
	};

	/**
	 * Enum IGActorSystem.ECachedBool
	 */
	enum class ECachedBool : uint8_t
	{
		CB_UNINITALIZED = 0,
		CB_TRUE         = 1,
		CB_FALSE        = 2,
		CB_MAX          = 3
	};

	/**
	 * Enum IGActorSystem.ESimultaneousInputDevice
	 */
	enum class ESimultaneousInputDevice : uint8_t
	{
		ESID_Gamepad  = 0,
		ESID_Keyboard = 1,
		ESID_MAX      = 2
	};

	/**
	 * Enum IGActorSystem.EPingRanges
	 */
	enum class EPingRanges : uint8_t
	{
		PING_LESS_THAN    = 0,
		PING_50_TO        = 1,
		PING_75_TO        = 2,
		PING_100_TO       = 3,
		PING_125_TO       = 4,
		PING_150_TO       = 5,
		PING_175_TO       = 6,
		PING_GREATER_THAN = 7,
		PING_MAX          = 8
	};

	/**
	 * Enum IGActorSystem.EIGPoseSpotActorState
	 */
	enum class EIGPoseSpotActorState : uint8_t
	{
		INACTIVE               = 0,
		ATTRACT                = 1,
		POSE_ACTIVATED         = 2,
		PERFECT_POSE_ACTIVATED = 3,
		COMPLETED              = 4,
		COOLDOWN               = 5,
		MAX                    = 6
	};

	/**
	 * Enum IGActorSystem.EBattlePassCelebrationReason
	 */
	enum class EBattlePassCelebrationReason : uint8_t
	{
		BPCR_None            = 0,
		BPCR_FanIncreaseOnly = 1,
		BPCR_TierIncrease    = 2,
		BPCR_MAX             = 3
	};

	/**
	 * Enum IGActorSystem.EBattlePassRewardUnlockType
	 */
	enum class EBattlePassRewardUnlockType : uint8_t
	{
		EBPRUT_Free = 0,
		EBPRUT_Paid = 1,
		EBPRUT_MAX  = 2
	};

	/**
	 * Enum IGActorSystem.EReasonFansAwarded
	 */
	enum class EReasonFansAwarded : uint8_t
	{
		ERingClosure        = 0,
		EPin                = 1,
		ETKO                = 2,
		EKnockdown          = 3,
		ERepDailyReward     = 4,
		ERepWeeklyReward    = 5,
		ERepSpecialReward   = 6,
		ERepCommunityReward = 7,
		EMatchOfTheDay      = 8,
		EFirstElim          = 9,
		EDefaultElim        = 10,
		EFinalSurvival      = 11,
		EDefaultSurvival    = 12,
		EPlacement10        = 13,
		EPlacement5         = 14,
		EPlacement2         = 15,
		EPlacement1         = 16,
		EDamageDealt        = 17,
		ESuperstarMeter     = 18,
		EPoseSpot           = 19,
		ECollectible        = 20,
		EDefault            = 21,
		MAX                 = 22
	};

	/**
	 * Enum IGActorSystem.EFanMailAssetRarity
	 */
	enum class EFanMailAssetRarity : uint8_t
	{
		AR_Uncommon  = 0,
		AR_Rare      = 1,
		AR_Epic      = 2,
		AR_Legendary = 3,
		AR_MAX       = 4
	};

	/**
	 * Enum IGActorSystem.EFanMailType
	 */
	enum class EFanMailType : uint8_t
	{
		TNC_Default       = 0,
		TNC_SeasonalEvent = 1,
		TNC_MAX           = 2
	};

	/**
	 * Enum IGActorSystem.EThresholdNotificationCadence
	 */
	enum class EThresholdNotificationCadence : uint8_t
	{
		TNC_None           = 0,
		TNC_Half           = 1,
		TNC_Third          = 2,
		TNC_Quarter        = 3,
		TNC_CustomInterval = 4,
		TNC_MAX            = 5
	};

	/**
	 * Enum IGActorSystem.ERepTargetComparisonType
	 */
	enum class ERepTargetComparisonType : uint8_t
	{
		RTCT_GreaterThanOrEqual = 0,
		RTCT_GreaterThan        = 1,
		RTCT_LessThanOrEqual    = 2,
		RTCT_LessThan           = 3,
		RTCT_MAX                = 4
	};

	/**
	 * Enum IGActorSystem.ERepProgressUpdateType
	 */
	enum class ERepProgressUpdateType : uint8_t
	{
		RPUT_Cumulative  = 0,
		RPUT_Subtractive = 1,
		RPUT_Maxima      = 2,
		RPUT_Minima      = 3,
		RPUT_MAX         = 4
	};

	/**
	 * Enum IGActorSystem.ERepType
	 */
	enum class ERepType : uint8_t
	{
		RT_None      = 0,
		RT_Daily     = 1,
		RT_Weekly    = 2,
		RT_Community = 3,
		RT_Special   = 4,
		RT_MAX       = 5
	};

	/**
	 * Enum IGActorSystem.ERepDifficulty
	 */
	enum class ERepDifficulty : uint8_t
	{
		RD_FirstTimer = 0,
		RD_Easy       = 1,
		RD_Moderate   = 2,
		RD_Hard       = 3,
		RD_ExtraHard  = 4,
		RD_MAX        = 5
	};

	/**
	 * Enum IGActorSystem.ERepRewardType
	 */
	enum class ERepRewardType : uint8_t
	{
		RRT_None           = 0,
		RRT_BattlePassXp   = 1,
		RRT_Currency       = 2,
		RRT_SingleCosmetic = 3,
		RRT_RandomCosmetic = 4,
		RRT_Coupon         = 5,
		RRT_FanMail        = 6,
		RTT_Fans           = 7,
		MAX                = 8
	};

	/**
	 * Enum IGActorSystem.EEndOfMatchBonusName
	 */
	enum class EEndOfMatchBonusName : uint8_t
	{
		EMBN_MatchOfTheDay            = 0,
		EMBN_Elimination_First        = 1,
		EMBN_Elimination_Default      = 2,
		EMBN_Survival_Final           = 3,
		EMBN_Survival_Default         = 4,
		EMBN_Placement                = 5,
		EMBN_Placement01              = 6,
		EMBN_Placement02              = 7,
		EMBN_Placement03              = 8,
		EMBN_DamageDealt              = 9,
		EMBN_SuperstarMeter           = 10,
		EMBN_AlternativeMatchOfTheDay = 11,
		EMBN_MAX                      = 12
	};

	/**
	 * Enum IGActorSystem.EMatchCompletionName
	 */
	enum class EMatchCompletionName : uint8_t
	{
		MCN_MatchOfTheDay     = 0,
		MCN_Elimination       = 1,
		MCN_Survival          = 2,
		MCN_Placement         = 3,
		MCN_Placement01       = 4,
		MCN_Placement02       = 5,
		MCN_Placement03       = 6,
		MCN_Placement_Default = 7,
		MCN_MAX               = 8
	};

	/**
	 * Enum IGActorSystem.EClassRepNodeMapping
	 */
	enum class EClassRepNodeMapping : uint8_t
	{
		NotRouted                = 0,
		RelevantAllConnections   = 1,
		Spatialize_Static        = 2,
		Spatialize_Dynamic       = 3,
		Spatialize_Dormancy      = 4,
		Spatialize_SpawnedStatic = 5,
		Spatialize_KA_Dynamic    = 6,
		Spatialize_KA_Dormancy   = 7,
		Spatialize_Character     = 8,
		MAX                      = 9
	};

	/**
	 * Enum IGActorSystem.EIGCollectibleRewardType
	 */
	enum class EIGCollectibleRewardType : uint8_t
	{
		HEALTH        = 0,
		STAMINA       = 1,
		PERK          = 2,
		FAME          = 3,
		PROGRESSIONXP = 4,
		INVALID       = 5,
		MAX           = 6
	};

	/**
	 * Enum IGActorSystem.EScriptedActorAction
	 */
	enum class EScriptedActorAction : uint8_t
	{
		SAC_Nothing     = 0,
		SAC_Melee       = 1,
		SAC_Jump        = 2,
		SAC_ElbowDrop   = 3,
		SAC_Climb       = 4,
		SAC_Grab        = 5,
		SAC_Taunt       = 6,
		SAC_Dash        = 7,
		SAC_Block       = 8,
		SAC_ThrowWeapon = 9,
		SAC_Max         = 10
	};

	/**
	 * Enum IGActorSystem.EIGShapeCastType
	 */
	enum class EIGShapeCastType : uint8_t
	{
		Line    = 0,
		Box     = 1,
		Sphere  = 2,
		Capsule = 3,
		MAX     = 4
	};

	/**
	 * Enum IGActorSystem.EIGCameraBehavior
	 */
	enum class EIGCameraBehavior : uint8_t
	{
		CB_None             = 0,
		CB_Strike           = 1,
		CB_AttachToAttacker = 2,
		CB_Dash             = 3,
		CB_RocketJump       = 4,
		CB_AutoFlip         = 5,
		CB_MAX              = 6
	};

	/**
	 * Enum IGActorSystem.EIGCameraZoomState
	 */
	enum class EIGCameraZoomState : uint8_t
	{
		None           = 0,
		Climb          = 1,
		Combat         = 2,
		Traversal      = 3,
		WaterInstakill = 4,
		DuosFreeFall   = 5,
		Swinging       = 6,
		MAX            = 7
	};

	/**
	 * Enum IGActorSystem.EIGCameraState
	 */
	enum class EIGCameraState : uint8_t
	{
		None             = 0,
		Death            = 1,
		WaterInstakill   = 2,
		Pin              = 3,
		Climb            = 4,
		Reorient         = 5,
		Combat           = 6,
		Fall             = 7,
		Traversal        = 8,
		Swinging         = 9,
		AttachToAttacker = 10,
		MAX              = 11
	};

	/**
	 * Enum IGActorSystem.EIGStaticInteractableActorState
	 */
	enum class EIGStaticInteractableActorState : uint8_t
	{
		UNDEFINED    = 0,
		INITIAL      = 1,
		INTERACTABLE = 2,
		INTERACTING  = 3,
		INTERACTED   = 4,
		MAX          = 5
	};

	/**
	 * Enum IGActorSystem.EIGSuperstarNotifyType
	 */
	enum class EIGSuperstarNotifyType : uint8_t
	{
		Activate   = 0,
		Deactivate = 1,
		MAX        = 2
	};

	/**
	 * Enum IGActorSystem.ETitleCardStackOrder
	 */
	enum class ETitleCardStackOrder : uint8_t
	{
		Top    = 0,
		Middle = 1,
		Bottom = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum IGActorSystem.EIGTitleCardPlatform
	 */
	enum class EIGTitleCardPlatform : uint8_t
	{
		EIGTCP_PSPlus   = 0,
		EIGTCP_Gamepass = 1,
		EIGTCP_Epic     = 2,
		EIGTCP_Agnostic = 3,
		EIGTCP_MAX      = 4
	};

	/**
	 * Enum IGActorSystem.EIGTitleCardStatType
	 */
	enum class EIGTitleCardStatType : uint8_t
	{
		Lifetime  = 0,
		Watermark = 1,
		MAX       = 2
	};

	/**
	 * Enum IGActorSystem.ESheikImageDataType
	 */
	enum class ESheikImageDataType : uint8_t
	{
		ESIDT_2DTexture = 0,
		ESIDT_Material  = 1,
		ESIDT_MAX       = 2
	};

	/**
	 * Enum IGActorSystem.ESheikTitleCardUnlockCriteria
	 */
	enum class ESheikTitleCardUnlockCriteria : uint8_t
	{
		ESTCUC_Default    = 0,
		ESTCUC_Battlepass = 1,
		ESTCUC_Leagues    = 2,
		ESTCUC_Purchase   = 3,
		ESTCUC_Challenges = 4,
		ESTCUC_MAX        = 5
	};

	/**
	 * Enum IGActorSystem.ESheikTitleCardDataType
	 */
	enum class ESheikTitleCardDataType : uint8_t
	{
		ESTCDT_PlayerTitle = 0,
		ESTCDT_Medal       = 1,
		ESTCDT_Stat        = 2,
		ESTCDT_PlayerPose  = 3,
		ESTCDT_Background  = 4,
		ESTCDT_Border      = 5,
		ESTCDT_MAX         = 6
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct IGActorSystem.IGLoadedMesh
	 * Size -> 0x0030
	 */
	struct FIGLoadedMesh
	{
	public:
		unsigned char                                              LoadedAsset[0x28];                                       // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              Layer;                                                   // 0x0028(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              HeadShapeId;                                             // 0x0029(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CoversHead;                                              // 0x002A(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ExceedsLayerThickness;                                   // 0x002B(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_866Z[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IGActorSystem.IGLoadedAccessory
	 * Size -> 0x0018
	 */
	struct FIGLoadedAccessory
	{
	public:
		EIGBodyType                                                BodyType;                                                // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LDLI[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FIGLoadedMesh>                               LoadedMeshes;                                            // 0x0008(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGContentReleaseVersion
	 * Size -> 0x0010
	 */
	struct FIGContentReleaseVersion
	{
	public:
		class FString                                              String;                                                  // 0x0000(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGWalletExportableProperties
	 * Size -> 0x0060
	 */
	struct FIGWalletExportableProperties
	{
	public:
		class UIGWalletAsset*                                      WalletAsset;                                             // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAccessoryItemRarity                                       RarityTier;                                              // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MJMT[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                Description;                                             // 0x0010(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		class FText                                                LongDescription;                                         // 0x0028(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		bool                                                       bUnlockEntitlementByDefault;                             // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EIGStarterSetEntitlement                                   StarterSetType;                                          // 0x0041(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EIGFlavorEntitlements                                      FlavorSetType;                                           // 0x0042(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EIGSeasonIdentifier                                        Season;                                                  // 0x0043(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B6VF[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                AccessorySetName;                                        // 0x0048(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGMaterialVariation
	 * Size -> 0x00A0
	 */
	struct FIGMaterialVariation
	{
	public:
		struct FIGContentReleaseVersion                            ReleaseVersion;                                          // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		unsigned char                                              MaterialInstances[0x10];                                 // 0x0010(0x0010) UNKNOWN PROPERTY: ArrayProperty
		struct FSoftObjectPath                                     Icon;                                                    // 0x0020(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                OverrideVariationGroupName;                              // 0x0038(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FIGWalletExportableProperties                       ExportableProperties;                                    // 0x0040(0x0060) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGAccessoryAsset
	 * Size -> 0x0150
	 */
	struct FIGAccessoryAsset
	{
	public:
		class FText                                                DisplayName;                                             // 0x0000(0x0018) Edit, NativeAccessSpecifierPublic
		EIGRegion                                                  Region;                                                  // 0x0018(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YCV6[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<EIGRegion>                                          OverlapRegions;                                          // 0x0020(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FIGLoadedAccessory                                  LoadedAccessories[0x6];                                  // 0x0030(0x0090) Edit, NativeAccessSpecifierPublic
		struct FGuid                                               GroupId;                                                 // 0x00C0(0x0010) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       NoHair;                                                  // 0x00D0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AltHair;                                                 // 0x00D1(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CoversMustache;                                          // 0x00D2(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CoversChin;                                              // 0x00D3(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CoversCheeks;                                            // 0x00D4(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       RequiresMinimumApparel;                                  // 0x00D5(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       OverlapRegionsRequireMinimumApparel;                     // 0x00D6(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsDefaultUndergarment;                                   // 0x00D7(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    PerfScore;                                               // 0x00D8(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		uint32_t                                                   SkinZonesToHide;                                         // 0x00DC(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              MaterialSlotsToHide[0x50];                               // 0x00E0(0x0050) UNKNOWN PROPERTY: SetProperty
		uint32_t                                                   ExceedsLayerThicknessRegions;                            // 0x0130(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		uint32_t                                                   OccupiesLowerLayersRegions;                              // 0x0134(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                VariationGroupName;                                      // 0x0138(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FIGMaterialVariation>                        MaterialVariations;                                      // 0x0140(0x0010) Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGModStackFloat
	 * Size -> 0x000C
	 */
	struct FIGModStackFloat
	{
	public:
		EIGModType                                                 ModType;                                                 // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_U9HX[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ModValue;                                                // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExpirationTimeStamp;                                     // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGModValueFloat
	 * Size -> 0x0018
	 */
	struct FIGModValueFloat
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VSHB[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FIGModStackFloat>                            StackMods;                                               // 0x0008(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGPerk
	 * Size -> 0x0038
	 */
	struct FIGPerk
	{
	public:
		class UIGPerkData*                                         PerkData;                                                // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                              Instigator;                                              // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExpirationTimeStamp;                                     // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S8FB[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    CurrentStacks;                                           // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ForceUseStatusUI;                                        // 0x001C(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WIET[0x9];                                   // 0x001D(0x0009) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bHasBeenActivated;                                       // 0x0026(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ROCE[0x11];                                  // 0x0027(0x0011) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IGActorSystem.IGPerkGroupingEntry
	 * Size -> 0x0010
	 */
	struct FIGPerkGroupingEntry
	{
	public:
		class UIGPerkData*                                         Perk;                                                    // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DefaultDistribution;                                     // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9OOM[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IGActorSystem.IGPerkProfileEntry
	 * Size -> 0x0018
	 */
	struct FIGPerkProfileEntry
	{
	public:
		class UIGPerkGrouping*                                     PerkGrouping;                                            // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DefaultDistribution;                                     // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NotChosenTickets;                                        // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AttemptsBeforeGuaranteed;                                // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0LK8[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IGActorSystem.ActorPoolSettings
	 * Size -> 0x0008
	 */
	struct FActorPoolSettings
	{
	public:
		int32_t                                                    InitialPoolSize;                                         // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    HardActiveLimit;                                         // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGMontageHistoryInfo
	 * Size -> 0x0010
	 */
	struct FIGMontageHistoryInfo
	{
	public:
		TWeakObjectPtr<class UIGMoveMontage>                       Montage;                                                 // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LastPositionSampled;                                     // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExpirationTime;                                          // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGAdditionalParams
	 * Size -> 0x0028
	 */
	struct FIGAdditionalParams
	{
	public:
		int32_t                                                    IntParam;                                                // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FloatParam;                                              // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                NameParam;                                               // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             VectorParam;                                             // 0x0010(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            RotatorParam;                                            // 0x001C(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.IGDamageBlockData
	 * Size -> 0x0028
	 */
	struct FIGDamageBlockData
	{
	public:
		float                                                      BlockPercent;                                            // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DNRK[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UIGMoveMontage*                                      OverrideReaction;                                        // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UIGMoveMontage*                                      InterceptReaction;                                       // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanStopGrapple;                                         // 0x0018(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanStopTracking;                                        // 0x0019(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bInvincible;                                             // 0x001A(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRequiresBlockInputState;                                // 0x001B(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanBeHitByOnTheGroundAttacks;                           // 0x001C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIgnoreStaminaDamage;                                    // 0x001D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAutoTargetAttacker;                                     // 0x001E(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Y50L[0x1];                                   // 0x001F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                SourceName;                                              // 0x0020(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.AnimationSwapMap
	 * Size -> 0x0050
	 */
	struct FAnimationSwapMap
	{
	public:
		TMap<class UAnimSequenceBase*, class UAnimSequenceBase*>   SequenceSwapMap;                                         // 0x0000(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.ComboLimitSettings
	 * Size -> 0x0008
	 */
	struct FComboLimitSettings
	{
	public:
		unsigned char                                              ComboLimit;                                              // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              ScaleLimit;                                              // 0x0001(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UMND[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DamageScaling;                                           // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IGActorSystem.HitLimitData
	 * Size -> 0x0018
	 */
	struct FHitLimitData
	{
	public:
		class AIGCharacter*                                        Attacker;                                                // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                Group;                                                   // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Timer;                                                   // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2J23[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IGActorSystem.IGPlatformingFallEndDistanceTierData
	 * Size -> 0x0010
	 */
	struct FIGPlatformingFallEndDistanceTierData
	{
	public:
		float                                                      Distance;                                                // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T2NO[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
