#pragma once

/**
 * Name: Rumbleverse
 * Version: Latest
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum Sheik.EGameFlowState
	 */
	enum class EGameFlowState : uint8_t
	{
		EGFS_FreeRoamMode      = 0,
		EGFS_WaitingForPlayers = 1,
		EGFS_WaitingToStart    = 2,
		EGFS_MatchInProgress   = 3,
		EGFS_WaitingToEnd      = 4,
		EGFS_MAX               = 5
	};

	/**
	 * Enum Sheik.ESheikGameModeType
	 */
	enum class ESheikGameModeType : uint8_t
	{
		None           = 0,
		BattleRoyale   = 1,
		Playground     = 2,
		Deathmatch     = 3,
		SnowballFight  = 4,
		CaptureTheFlag = 5,
		MAX            = 6
	};

	/**
	 * Enum Sheik.ESheikHudRegion
	 */
	enum class ESheikHudRegion : uint8_t
	{
		ESHR_Input                    = 0,
		ESHR_Perks                    = 1,
		ESHR_EventHistory             = 2,
		ESHR_GameplayNotifications    = 3,
		ESHR_ProgressionNotifications = 4,
		ESHR_SocialNotifications      = 5,
		ESHR_MAX                      = 6
	};

	/**
	 * Enum Sheik.ESheikPinEventType
	 */
	enum class ESheikPinEventType : uint8_t
	{
		Inactive                = 0,
		Available               = 1,
		Unavailable             = 2,
		Started                 = 3,
		InputSuccess            = 4,
		Countdown               = 5,
		Countdown01             = 6,
		Countdown02             = 7,
		Kickout                 = 8,
		Interrupted             = 9,
		Aborted                 = 10,
		TeammatePinned          = 11,
		TeammateEliminated      = 12,
		TeammateKickout         = 13,
		TeammateKOInsurance     = 14,
		ResurrectionAvailable   = 15,
		ResurrectionUnavailable = 16,
		ResurrectionStarted     = 17,
		Resurrected             = 18,
		ResurrectionInterrupted = 19,
		ResurrectionAborted     = 20,
		MAX                     = 21
	};

	/**
	 * Enum Sheik.EIGPingType
	 */
	enum class EIGPingType : uint8_t
	{
		LocationPing = 0,
		MAX          = 1
	};

	/**
	 * Enum Sheik.ESheikWaypointType
	 */
	enum class ESheikWaypointType : uint8_t
	{
		None                 = 0,
		SWT_FriendlyPlayer   = 1,
		SWT_EnemyPlayer      = 2,
		SWT_Event            = 3,
		SWT_CircleRing       = 4,
		SWT_CircleTargetRing = 5,
		SWT_CircleNextRing   = 6,
		SWT_SquareRing       = 7,
		SWT_SquareTargetRing = 8,
		SWT_SquareNextRing   = 9,
		SWT_Barge            = 10,
		SWT_Ping             = 11,
		MAX                  = 12
	};

	/**
	 * Enum Sheik.EPlayingMode
	 */
	enum class EPlayingMode : uint8_t
	{
		EPM_None       = 0,
		EPM_Playing    = 1,
		EPM_Spectating = 2,
		EPM_MAX        = 3
	};

	/**
	 * Enum Sheik.EPopupPriority
	 */
	enum class EPopupPriority : uint8_t
	{
		EPP_NORMAL = 0,
		EPP_HIGH   = 1,
		EPP_URGENT = 2,
		EPP_MAX    = 3
	};

	/**
	 * Enum Sheik.EPopupType
	 */
	enum class EPopupType : uint8_t
	{
		EPT_NONE         = 0,
		EPT_GENERIC      = 1,
		EPT_ERROR        = 2,
		EPT_OPEN_FANMAIL = 3,
		EPT_CUSTOM       = 4,
		EPT_MAX          = 5
	};

	/**
	 * Enum Sheik.ESheikUserPrivilegeResult
	 */
	enum class ESheikUserPrivilegeResult : uint8_t
	{
		NoFailures               = 0,
		PrivilegeBlocked         = 1,
		AgeRestricted            = 2,
		IdentityInterfaceMissing = 3,
		MAX                      = 4
	};

	/**
	 * Enum Sheik.ESheikErrorSystem
	 */
	enum class ESheikErrorSystem : uint8_t
	{
		General      = 0,
		Login        = 1,
		PlayerData   = 2,
		Matchmaking  = 3,
		TitleStorage = 4,
		Entitlements = 5,
		Store        = 6,
		Achievements = 7,
		Accounts     = 8,
		MAX          = 9
	};

	/**
	 * Enum Sheik.ESheikErrorSource
	 */
	enum class ESheikErrorSource : uint8_t
	{
		Client      = 0,
		CozmoServer = 1,
		Platform    = 2,
		MAX         = 3
	};

	/**
	 * Enum Sheik.ESheikGameModeSlotType
	 */
	enum class ESheikGameModeSlotType : uint8_t
	{
		None   = 0,
		Small  = 1,
		Medium = 2,
		Large  = 3,
		MAX    = 4
	};

	/**
	 * Enum Sheik.ESheikBetaParticipationSegment
	 */
	enum class ESheikBetaParticipationSegment : uint8_t
	{
		ESBPS_CBTParticipant  = 0,
		ESBPS_OBTParticipant  = 1,
		ESBPS_BothParticipant = 2,
		ESBPS_BetaAgnostic    = 3,
		ESBPS_MAX             = 4
	};

	/**
	 * Enum Sheik.ESheikBattlePassSegment
	 */
	enum class ESheikBattlePassSegment : uint8_t
	{
		ESBPS_Owned    = 0,
		ESBPS_NotOwned = 1,
		ESBPS_Agnostic = 2,
		ESBPS_MAX      = 3
	};

	/**
	 * Enum Sheik.ESheikPlatformSegment
	 */
	enum class ESheikPlatformSegment : uint8_t
	{
		ESPS_Windows      = 0,
		ESPS_PlayStation4 = 1,
		ESPS_PlayStation5 = 2,
		ESPS_XboxOne      = 3,
		ESPS_XboxSeriesX  = 4,
		ESPS_AllPlatforms = 5,
		ESPS_MAX          = 6
	};

	/**
	 * Enum Sheik.ESheikNoticePriority
	 */
	enum class ESheikNoticePriority : uint8_t
	{
		ESNP_High   = 0,
		ESNP_Medium = 1,
		ESNP_Low    = 2,
		ESNP_MAX    = 3
	};

	/**
	 * Enum Sheik.ESheikLoginResultType
	 */
	enum class ESheikLoginResultType : uint8_t
	{
		LoginSuccess  = 0,
		CozmoFailure  = 1,
		AccountBanned = 2,
		MAX           = 3
	};

	/**
	 * Enum Sheik.ESheikLoginStatus
	 */
	enum class ESheikLoginStatus : uint8_t
	{
		SLS_NotLoggedIn     = 0,
		SLS_WaitingForLogin = 1,
		SLS_LoggedIn        = 2,
		SLS_MAX             = 3
	};

	/**
	 * Enum Sheik.EMatchConfigType
	 */
	enum class EMatchConfigType : uint8_t
	{
		MCT_Default    = 0,
		MCT_Onboarding = 1,
		MCT_Sympathy   = 2,
		MCT_Excluded   = 3,
		MCT_MAX        = 4
	};

	/**
	 * Enum Sheik.ESheikPresence
	 */
	enum class ESheikPresence : uint8_t
	{
		Invalid       = 0,
		LoadingScreen = 1,
		Frontend      = 2,
		Playground    = 3,
		GenericMatch  = 4,
		SolosMatch    = 5,
		DuosMatch     = 6,
		TriosMatch    = 7,
		QuadsMatch    = 8,
		MAX           = 9
	};

	/**
	 * Enum Sheik.ESheikPlatformService
	 */
	enum class ESheikPlatformService : uint8_t
	{
		EpicOnlineServices = 0,
		PlaystationNetwork = 1,
		XboxLive           = 2,
		Switch             = 3,
		Unknown            = 4,
		MAX                = 5
	};

	/**
	 * Enum Sheik.ESheikBuildConfig
	 */
	enum class ESheikBuildConfig : uint8_t
	{
		SBC_Development = 0,
		SBC_Test        = 1,
		SBC_Shipping    = 2,
		SBC_Milestone   = 3,
		SBC_MAX         = 4
	};

	/**
	 * Enum Sheik.ESheikNavAreaFlag
	 */
	enum class ESheikNavAreaFlag : uint8_t
	{
		Blueprint_Custom1 = 0,
		Blueprint_Custom2 = 1,
		Blueprint_Custom3 = 2,
		Blueprint_Custom4 = 3,
		SheikNavArea_Jump = 4,
		SheikNavArea_Fall = 5,
		MAX               = 6
	};

	/**
	 * Enum Sheik.EAccessoryType
	 */
	enum class EAccessoryType : uint8_t
	{
		EAT_None      = 0,
		EAT_BodyShape = 1,
		EAT_SkinColor = 2,
		EAT_HeadShape = 3,
		EAT_EyeColor  = 4,
		EAT_Hair      = 5,
		EAT_Accessory = 6,
		EAT_Emote     = 7,
		EAT_Outfit    = 8,
		EAT_Tattoo    = 9,
		EAT_Makeup    = 10,
		EAT_Eyebrow   = 11,
		EAT_MAX       = 12
	};

	/**
	 * Enum Sheik.ESheikPlatform
	 */
	enum class ESheikPlatform : uint8_t
	{
		Windows = 0,
		PS4     = 1,
		PS5     = 2,
		XboxOne = 3,
		XSX     = 4,
		Switch  = 5,
		Unknown = 6,
		MAX     = 7
	};

	/**
	 * Enum Sheik.EEOSLobbyStatus
	 */
	enum class EEOSLobbyStatus : uint8_t
	{
		Success = 0,
		Joining = 1,
		Failed  = 2,
		Unset   = 3,
		MAX     = 4
	};

	/**
	 * Enum Sheik.ESheikPartyJoinFailure
	 */
	enum class ESheikPartyJoinFailure : uint8_t
	{
		ESPJF_Unknown          = 0,
		ESPJF_HostDeclined     = 1,
		ESPJF_PartyFull        = 2,
		ESPJF_PartyNotFound    = 3,
		ESPJF_PartyGameSession = 4,
		ESPJF_PrivacySettings  = 5,
		ESPJF_MAX              = 6
	};

	/**
	 * Enum Sheik.ESheikVOIPPartyType
	 */
	enum class ESheikVOIPPartyType : uint8_t
	{
		ESVPT_None         = 0,
		ESVPT_PrivateParty = 1,
		ESVPT_TeamParty    = 2,
		ESVPT_All          = 3,
		ESVPT_MAX          = 4
	};

	/**
	 * Enum Sheik.EIGPingContextState
	 */
	enum class EIGPingContextState : uint8_t
	{
		InactivePingContext  = 0,
		PingContextInitiated = 1,
		PingContextMode      = 2,
		PingContextConfirm   = 3,
		MAX                  = 4
	};

	/**
	 * Enum Sheik.ESheikModValueType
	 */
	enum class ESheikModValueType : uint8_t
	{
		SheikMod_Base   = 0,
		Core            = 1,
		Arms            = 2,
		Legs            = 3,
		CombinedMaxStat = 4,
		MAX             = 5
	};

	/**
	 * Enum Sheik.ESheikFunnelLocation
	 */
	enum class ESheikFunnelLocation : uint8_t
	{
		Boot                       = 0,
		TitleStart                 = 1,
		TitleEULA                  = 2,
		TitleEULASkip              = 3,
		TitleAccountLinking        = 4,
		TitleKWSDOBEntry           = 5,
		TitleKWSDOBBack            = 6,
		TitleKWSDOBSkip            = 7,
		TitleKWSEmailEntry         = 8,
		TitleKWSEmailFailed        = 9,
		TitleKWSEmailSkip          = 10,
		TitleKWSPermissionsPending = 11,
		TitleKWSPermissionsBack    = 12,
		TitleKWSGuardianRejected   = 13,
		LoadingScreen              = 14,
		FrontendNotices            = 15,
		FrontendNoticesSkip        = 16,
		FrontendLanding            = 17,
		MAX                        = 18
	};

	/**
	 * Enum Sheik.ESheikStoreSlotType
	 */
	enum class ESheikStoreSlotType : uint8_t
	{
		None   = 0,
		Small  = 1,
		Medium = 2,
		Large  = 3,
		MAX    = 4
	};

	/**
	 * Enum Sheik.ESheikStoreItemType
	 */
	enum class ESheikStoreItemType : uint8_t
	{
		Single     = 0,
		Bundle     = 1,
		Outfit     = 2,
		Battlepass = 3,
		RMT        = 4,
		Invalid    = 5,
		MAX        = 6
	};

	/**
	 * Enum Sheik.EStoreOfferType
	 */
	enum class EStoreOfferType : uint8_t
	{
		ESOT_NONE       = 0,
		ESOT_COZMO      = 1,
		ESOT_THIRDPARTY = 2,
		ESOT_MAX        = 3
	};

	/**
	 * Enum Sheik.ESheikStoreErrorType
	 */
	enum class ESheikStoreErrorType : uint8_t
	{
		Ok              = 0,
		QueryInProgress = 1,
		QueryFailed     = 2,
		MAX             = 3
	};

	/**
	 * Enum Sheik.ESheikGenericInputPrompt
	 */
	enum class ESheikGenericInputPrompt : uint8_t
	{
		ESGIP_None                = 0,
		ESGIP_Launch              = 1,
		ESGIP_FreeFall            = 2,
		ESGIP_BreakOut            = 3,
		ESGIP_Jump                = 4,
		ESGIP_Attack              = 5,
		ESGIP_Grab                = 6,
		ESGIP_Pin                 = 7,
		ESGIP_DropItem            = 8,
		ESGIP_PickUpItem          = 9,
		ESGIP_Consume             = 10,
		ESGIP_WeaponAttack        = 11,
		ESGIP_WeaponViciousAttack = 12,
		ESGIP_ElbowDrop           = 13,
		ESGIP_LongJump            = 14,
		ESGIP_WallJump            = 15,
		ESGIP_WallDash            = 16,
		ESGIP_GetUp               = 17,
		ESGIP_SpinAttack          = 18,
		ESGIP_LowBlow             = 19,
		ESGIP_DropKick            = 20,
		ESGIP_Climb               = 21,
		ESGIP_DetachFromClimbing  = 22,
		ESGIP_Backflip            = 23,
		ESGIP_ContinueCombo       = 24,
		ESGIP_MAX                 = 25
	};

	/**
	 * Enum Sheik.ESheikMovesetPromptType
	 */
	enum class ESheikMovesetPromptType : uint8_t
	{
		ESMP_None                    = 0,
		ESMP_InitialLaunchFromCannon = 1,
		ESMP_FreeFall                = 2,
		ESMP_KnockedDown             = 3,
		ESMP_StartOfDash             = 4,
		ESMP_Dashing                 = 5,
		ESMP_Blocking                = 6,
		ESMP_Emote                   = 7,
		ESMP_MAX                     = 8
	};

	/**
	 * Enum Sheik.ESheikAnnouncementPriority
	 */
	enum class ESheikAnnouncementPriority : uint8_t
	{
		ESAP_Low           = 0,
		ESAP_Normal        = 1,
		ESAP_High          = 2,
		ESAP_ExtremelyHigh = 3,
		ESAP_MAX           = 4
	};

	/**
	 * Enum Sheik.ESheikAnnouncementType
	 */
	enum class ESheikAnnouncementType : uint8_t
	{
		ESAT_None                    = 0,
		ESAT_Generic                 = 1,
		ESAT_Perk                    = 2,
		ESAT_BalloonRun              = 3,
		ESAT_BalloonRunCountdown     = 4,
		ESAT_BalloonRunVictory       = 5,
		ESAT_BalloonRunResults       = 6,
		ESAT_GenericEvent            = 7,
		ESAT_RingOut                 = 8,
		ESAT_NextRing                = 9,
		ESAT_RingShrinking           = 10,
		ESAT_CannonLaunch            = 11,
		ESAT_RepProgress             = 12,
		ESAT_FanCloutProgression     = 13,
		ESAT_TeamCannonLaunchStarted = 14,
		ESAT_MAX                     = 15
	};

	/**
	 * Enum Sheik.ESheikCareerScreenSortCriteria
	 */
	enum class ESheikCareerScreenSortCriteria : uint8_t
	{
		ESCSSC_NewFirst     = 0,
		ESCSSC_OldFirst     = 1,
		ESCSSC_OwnedFirst   = 2,
		ESCSSC_UnownedFirst = 3,
		ESCSSC_MAX          = 4
	};

	/**
	 * Enum Sheik.ESheikCareerScreenFilterOption
	 */
	enum class ESheikCareerScreenFilterOption : uint8_t
	{
		ESCSFO_Default           = 0,
		ESCSFO_CurrSeasonAll     = 1,
		ESCSFO_CurrSeasonUnowned = 2,
		ESCSFO_CurrSeasonOwned   = 3,
		ESCSFO_PriorSeasonOwned  = 4,
		ESCSFO_Battlepass        = 5,
		ESCSFO_Leagues           = 6,
		ESCSFO_Purchase          = 7,
		ESCSFO_Challenges        = 8,
		ESCSFO_DebugOnly         = 9,
		ESCSFO_MAX               = 10
	};

	/**
	 * Enum Sheik.ESheikFilterType
	 */
	enum class ESheikFilterType : uint8_t
	{
		ESFT_None          = 0,
		ESFT_New           = 1,
		ESFT_Head          = 2,
		ESFT_Head_Subcat   = 3,
		ESFT_Hair          = 4,
		ESFT_FacialHair    = 5,
		ESFT_HeadMisc      = 6,
		ESFT_Torso         = 7,
		ESFT_Chest         = 8,
		ESFT_Elbow         = 9,
		ESFT_Hand          = 10,
		ESFT_UpperArm      = 11,
		ESFT_Forearm       = 12,
		ESFT_Abdomen       = 13,
		ESFT_UpperBodyMisc = 14,
		ESFT_LowerBody     = 15,
		ESFT_Legs          = 16,
		ESFT_Knee          = 17,
		ESFT_Feet          = 18,
		ESFT_LowerBodyMisc = 19,
		ESFT_Favorites     = 20,
		ESFT_Equipped      = 21,
		ESFT_Purchasable   = 22,
		ESFT_Affordable    = 23,
		ESFT_Unique        = 24,
		ESFT_MAX           = 25
	};

	/**
	 * Enum Sheik.ESheikSortingType
	 */
	enum class ESheikSortingType : uint8_t
	{
		ESST_Seen                      = 0,
		ESST_Newest                    = 1,
		ESST_StyleBudgetCostAscending  = 2,
		ESST_StyleBudgetCostDescending = 3,
		ESST_AlphabeticalAscending     = 4,
		ESST_AlphabeticalDescending    = 5,
		ESST_RarityAscending           = 6,
		ESST_RarityDescending          = 7,
		ESST_MAX                       = 8
	};

	/**
	 * Enum Sheik.ESheikFrontendNotificationType
	 */
	enum class ESheikFrontendNotificationType : uint8_t
	{
		PartyYouJoined      = 0,
		PartyYouLeft        = 1,
		PartyPlayerJoined   = 2,
		PartyPlayerLeft     = 3,
		PartyPlayerKicked   = 4,
		PartyInviteSent     = 5,
		PartyInviteReceived = 6,
		Unknown             = 7,
		MAX                 = 8
	};

	/**
	 * Enum Sheik.ESmokeConnectTaskState
	 */
	enum class ESmokeConnectTaskState : uint8_t
	{
		SCT_WaitingForPlayers = 0,
		SCT_TakingActions     = 1,
		SCT_Booting           = 2,
		SCT_MAX               = 3
	};

	/**
	 * Enum Sheik.ENavAreaFlag
	 */
	enum class ENavAreaFlag : uint8_t
	{
		Default = 0,
		Custom  = 1,
		MAX     = 2
	};

	/**
	 * Enum Sheik.EInvokerShape
	 */
	enum class EInvokerShape : uint8_t
	{
		Circle = 0,
		Square = 1,
		MAX    = 2
	};

	/**
	 * Enum Sheik.EBotTrappedSource
	 */
	enum class EBotTrappedSource : uint8_t
	{
		None          = 0,
		OffNavMesh    = 1,
		StuckWalking  = 2,
		StuckClimbing = 3,
		NoValidOption = 4,
		PathingFailed = 5,
		MAX           = 6
	};

	/**
	 * Enum Sheik.EBotItemCategory
	 */
	enum class EBotItemCategory : uint8_t
	{
		None     = 0,
		Crate    = 1,
		Fame     = 2,
		Health   = 3,
		Magazine = 4,
		Stamina  = 5,
		StatPod  = 6,
		Weapon   = 7,
		MAX      = 8
	};

	/**
	 * Enum Sheik.EBotAttackOption
	 */
	enum class EBotAttackOption : uint8_t
	{
		None        = 0,
		BackToss    = 1,
		BasicChop   = 2,
		ChargeChop  = 3,
		Dropkick    = 4,
		ElbowDrop   = 5,
		Grab        = 6,
		GroundPound = 7,
		HammerFist  = 8,
		IrishWhip   = 9,
		Special1    = 10,
		Special2    = 11,
		SpinKick    = 12,
		Block       = 13,
		MAX         = 14
	};

	/**
	 * Enum Sheik.ESheikUserPrivilege
	 */
	enum class ESheikUserPrivilege : uint8_t
	{
		Multiplayer    = 0,
		CrossPlay      = 1,
		Communications = 2,
		MAX            = 3
	};

	/**
	 * Enum Sheik.ECaptureState
	 */
	enum class ECaptureState : uint8_t
	{
		CS_Invalid           = 0,
		CS_LoadingUnusable   = 1,
		CS_LoadingUsable     = 2,
		CS_ReadyForMeshSet   = 3,
		CS_ReadyForPose      = 4,
		CS_ReadyForCapture   = 5,
		CS_ReadyForUICapture = 6,
		CS_Captured          = 7,
		CS_CaptureState_Max  = 8,
		CS_MAX               = 9
	};

	/**
	 * Enum Sheik.EDownedType
	 */
	enum class EDownedType : uint8_t
	{
		DT_Pinnable      = 0,
		DT_Resurrectable = 1,
		DT_KOInsurance   = 2,
		DT_MAX           = 3
	};

	/**
	 * Enum Sheik.ESheikLaunchActionType
	 */
	enum class ESheikLaunchActionType : uint8_t
	{
		BecomeLaunchMaster = 0,
		ReleaseTeammates   = 1,
		MAX                = 2
	};

	/**
	 * Enum Sheik.ESheikEdgeNavLinkGenerationType
	 */
	enum class ESheikEdgeNavLinkGenerationType : uint8_t
	{
		TYPE_Fixed             = 0,
		TYPE_LedgeDown         = 1,
		TYPE_Projectile        = 2,
		TYPE_FallingProjectile = 3,
		TYPE_Flat              = 4,
		TYPE_MAX               = 5
	};

	/**
	 * Enum Sheik.ESheikClientGeneralError
	 */
	enum class ESheikClientGeneralError : uint8_t
	{
		Unspecified      = 0,
		LoadingTimeout   = 1,
		LocalStorageFull = 2,
		UpdateRequired   = 3,
		MAX              = 4
	};

	/**
	 * Enum Sheik.ESheikFriendsSortParameters
	 */
	enum class ESheikFriendsSortParameters : uint8_t
	{
		OnlineStatus     = 0,
		NameAlphabetical = 1,
		Platform         = 2,
		MAX              = 3
	};

	/**
	 * Enum Sheik.EIGMonitorMatchEvent
	 */
	enum class EIGMonitorMatchEvent : uint8_t
	{
		MatchEvent_Debug        = 0,
		MatchEvent_LastChampion = 1,
		MatchEvent_KOLeader     = 2,
		MatchEvent_DeathEvent   = 3,
		MatchEvent_NewChampion  = 4,
		MatchEvent_MAX          = 5
	};

	/**
	 * Enum Sheik.EIGMonitorLayout
	 */
	enum class EIGMonitorLayout : uint8_t
	{
		EIGML_DisplaySingle = 0,
		EIGML_DisplayPair   = 1,
		EIGML_MAX           = 2
	};

	/**
	 * Enum Sheik.EIGMonitorState
	 */
	enum class EIGMonitorState : uint8_t
	{
		EIGMS_Inactive               = 0,
		EIGMS_LoadingMeshForCapture  = 1,
		EIGMS_LoadingRemainingAssets = 2,
		EIGMS_RequestedCapture       = 3,
		EIGMS_DisplayingCapture      = 4,
		EIGMS_DisplayingButReady     = 5,
		EIGMS_MAX                    = 6
	};

	/**
	 * Enum Sheik.ESheikMatchTimerHUDStatus
	 */
	enum class ESheikMatchTimerHUDStatus : uint8_t
	{
		NoTimer               = 0,
		RingWaiting           = 1,
		RingShrinking         = 2,
		EventCountdownToStart = 3,
		EventCountdownToEnd   = 4,
		FreeRoam              = 5,
		MAX                   = 6
	};

	/**
	 * Enum Sheik.ESheikActionBindingSlot
	 */
	enum class ESheikActionBindingSlot : uint8_t
	{
		ESABS_PrimarySlot   = 0,
		ESABS_SecondarySlot = 1,
		ESABS_MAX           = 2
	};

	/**
	 * Enum Sheik.ELiveOpsMessageComponents
	 */
	enum class ELiveOpsMessageComponents : uint8_t
	{
		MESSAGETYPE     = 0,
		MESSAGEPLATFORM = 1,
		MESSAGEKICK     = 2,
		MESSAGETIME     = 3,
		MAX             = 4
	};

	/**
	 * Enum Sheik.ELiveOpsMessagePlatform
	 */
	enum class ELiveOpsMessagePlatform : uint8_t
	{
		PC   = 0,
		PS4  = 1,
		PS5  = 2,
		XBO  = 3,
		XSX  = 4,
		NONE = 5,
		MAX  = 6
	};

	/**
	 * Enum Sheik.ELiveOpsMessageType
	 */
	enum class ELiveOpsMessageType : uint8_t
	{
		Unset        = 0,
		Login        = 1,
		Planned      = 2,
		Offline      = 3,
		Payment      = 4,
		Matchmaking  = 5,
		Party        = 6,
		Voip         = 7,
		Locker       = 8,
		FanMail      = 9,
		BattlePass   = 10,
		Shop         = 11,
		Career       = 12,
		Challenge    = 13,
		BrawllaBills = 14,
		FriendsList  = 15,
		Settings     = 16,
		EndSession   = 17,
		MAX          = 18
	};

	/**
	 * Enum Sheik.ELoadFlowState
	 */
	enum class ELoadFlowState : uint8_t
	{
		ELFS_Incomplete   = 0,
		ELFS_Initializing = 1,
		ELFS_Preloading   = 2,
		ELFS_Preloaded    = 3,
		ELFS_Hotfixing    = 4,
		ELFS_LoadCalled   = 5,
		ELFS_MAX          = 6
	};

	/**
	 * Enum Sheik.ESheikLoadingScreenLoadType
	 */
	enum class ESheikLoadingScreenLoadType : uint8_t
	{
		None            = 0,
		EntryToFrontend = 1,
		FrontendToEntry = 2,
		FrontendToMap   = 3,
		MapToMap        = 4,
		MapToFrontend   = 5,
		MAX             = 6
	};

	/**
	 * Enum Sheik.ESheikLoginCallError
	 */
	enum class ESheikLoginCallError : uint8_t
	{
		CozmoLogin            = 0,
		EOSLogin              = 1,
		Logout                = 2,
		CozmoQueryBanInfo     = 3,
		TokenRetrieval        = 4,
		EOSRemoveLocalAccount = 5,
		CozmoQueue            = 6,
		KWSQueryAgeGate       = 7,
		KWSQueryPermissions   = 8,
		KWSCreateAccount      = 9,
		KWSUpdateEmail        = 10,
		CozmoForcedLogout     = 11,
		MAX                   = 12
	};

	/**
	 * Enum Sheik.ESheikLoginCredentialType
	 */
	enum class ESheikLoginCredentialType : uint8_t
	{
		LCT_Developer      = 0,
		LCT_AuthToken      = 1,
		LCT_AccountPortal  = 2,
		LCT_PersistentAuth = 3,
		LCT_AutoLogin      = 4,
		LCT_MAX            = 5
	};

	/**
	 * Enum Sheik.ESheikEOSLoginError
	 */
	enum class ESheikEOSLoginError : uint8_t
	{
		Other                        = 0,
		InvalidUser                  = 1,
		CreateUserFailed             = 2,
		ExchangeCodeNotFound         = 3,
		PlatformTokenRetrievalFailed = 4,
		ConnectionOffline            = 5,
		MAX                          = 6
	};

	/**
	 * Enum Sheik.ESheikFinalRingBehaviors
	 */
	enum class ESheikFinalRingBehaviors : uint8_t
	{
		NONE                  = 0,
		ESFRB_NonCombatShrink = 1,
		ESFRB_PersisentShrink = 2,
		ESFRB_LinearMove      = 3,
		MAX                   = 4
	};

	/**
	 * Enum Sheik.ESheikMatchmakingCallError
	 */
	enum class ESheikMatchmakingCallError : uint8_t
	{
		StartMatchmaking  = 0,
		JoinSession       = 1,
		CancelMatchmaking = 2,
		Hotfix            = 3,
		MAX               = 4
	};

	/**
	 * Enum Sheik.ESheikOnlineAsyncTaskPriority
	 */
	enum class ESheikOnlineAsyncTaskPriority : uint8_t
	{
		SOATP_Normal = 0,
		SOATP_High   = 1,
		SOATP_MAX    = 2
	};

	/**
	 * Enum Sheik.ESheikOnlineAsyncTaskStatus
	 */
	enum class ESheikOnlineAsyncTaskStatus : uint8_t
	{
		SOATS_Start     = 0,
		SOATS_Running   = 1,
		SOATS_Failed    = 2,
		SOATS_Succeeded = 3,
		SOATS_MAX       = 4
	};

	/**
	 * Enum Sheik.ESheikOnlineAsyncTaskType
	 */
	enum class ESheikOnlineAsyncTaskType : uint8_t
	{
		SOATT_SetAttributes                = 0,
		SOATT_CreateParty                  = 1,
		SOATT_LeaveParty                   = 2,
		SOATT_FindParty                    = 3,
		SOATT_JoinParty                    = 4,
		SOATT_KickPlayer                   = 5,
		SOATT_SendPartyMessage             = 6,
		SOATT_UpdatePartySettings          = 7,
		SOATT_PromoteLeader                = 8,
		SOATT_InviteToCozmoParty           = 9,
		SOATT_InviteToPlatformParty        = 10,
		SOATT_ShowPlatformExternalInviteUI = 11,
		SOATT_StorePurchase                = 12,
		SOATT_GetCommunicationPermissions  = 13,
		SOATT_MAX                          = 14
	};

	/**
	 * Enum Sheik.ESheikPartyNotificationType
	 */
	enum class ESheikPartyNotificationType : uint8_t
	{
		SPNT_None               = 0,
		SPNT_InviteReceived     = 1,
		SPNT_PlayerJoined       = 2,
		SPNT_PlayerLeft         = 3,
		SPNT_PlayerKicked       = 4,
		SPNT_JoiningOtherPlayer = 5,
		SPNT_MAX                = 6
	};

	/**
	 * Enum Sheik.ESheikPartySearchType
	 */
	enum class ESheikPartySearchType : uint8_t
	{
		SPST_PartyId        = 0,
		SPST_LeaderPlayerId = 1,
		SPST_PartyGuid      = 2,
		SPST_FriendId       = 3,
		SPST_SessionId      = 4,
		SPST_MAX            = 5
	};

	/**
	 * Enum Sheik.ESheikSessionPrivacy
	 */
	enum class ESheikSessionPrivacy : uint8_t
	{
		ESSP_Open        = 0,
		ESSP_FriendsOnly = 1,
		ESSP_InviteOnly  = 2,
		ESSP_MAX         = 3
	};

	/**
	 * Enum Sheik.ESheikParallelTaskStatus
	 */
	enum class ESheikParallelTaskStatus : uint8_t
	{
		NotStarted = 0,
		Running    = 1,
		Failed     = 2,
		Succeeded  = 3,
		Cancelled  = 4,
		MAX        = 5
	};

	/**
	 * Enum Sheik.ESheikPendingPartyInviteStatus
	 */
	enum class ESheikPendingPartyInviteStatus : uint8_t
	{
		SPPIS_None                   = 0,
		SPPIS_HostPlatformParty      = 1,
		SPPIS_AcceptedPlatformInvite = 2,
		SPPIS_ReceivedCozmoInvite    = 3,
		SPPIS_MAX                    = 4
	};

	/**
	 * Enum Sheik.ESheikPingDirection
	 */
	enum class ESheikPingDirection : uint8_t
	{
		None       = 0,
		UpArrow    = 1,
		DownArrow  = 2,
		LeftArrow  = 3,
		RightArrow = 4,
		MAX        = 5
	};

	/**
	 * Enum Sheik.EResurrectionPerformanceState
	 */
	enum class EResurrectionPerformanceState : uint8_t
	{
		RPS_None        = 0,
		RPS_Startup     = 1,
		RPS_Countdown   = 2,
		RPS_Resurrected = 3,
		RPS_Max         = 4
	};

	/**
	 * Enum Sheik.EPinPerformanceState
	 */
	enum class EPinPerformanceState : uint8_t
	{
		PPS_None                      = 0,
		PPS_Startup                   = 1,
		PPS_AttackerPinJump           = 2,
		PPS_AttackerPinInAir          = 3,
		PPS_StartMiniGame             = 4,
		PPS_WaitingForMiniGameStartup = 5,
		PPS_CountingDown              = 6,
		PPS_CountdownComplete         = 7,
		PPS_VictimKickout             = 8,
		PPS_MAX                       = 9
	};

	/**
	 * Enum Sheik.EPinState
	 */
	enum class EPinState : uint8_t
	{
		None             = 0,
		AwaitingPin      = 1,
		PerformingPin    = 2,
		BeingResurrected = 3,
		Aborted          = 4,
		Eliminated       = 5,
		Kickout          = 6,
		Interrupt        = 7,
		Finished         = 8,
		Resurrected      = 9,
		Pinner           = 10,
		Rescuer          = 11,
		MAX              = 12
	};

	/**
	 * Enum Sheik.ESheikPinCountdownType
	 */
	enum class ESheikPinCountdownType : uint8_t
	{
		None  = 0,
		One   = 1,
		Two   = 2,
		Three = 3,
		MAX   = 4
	};

	/**
	 * Enum Sheik.ESheikAccountsError
	 */
	enum class ESheikAccountsError : uint8_t
	{
		InvalidReportData = 0,
		EOS_SendReport    = 1,
		Crossplay         = 2,
		Party             = 3,
		MAX               = 4
	};

	/**
	 * Enum Sheik.ESheikPlayerDataError
	 */
	enum class ESheikPlayerDataError : uint8_t
	{
		Download_CozmoDownloadFailed            = 0,
		Download_CozmoDownloadCompletedFailed   = 1,
		Upload_NoPlayerDataLoaded               = 2,
		Upload_PlayerDataNotInitialized         = 3,
		Upload_JsonConverterFailed              = 4,
		Download_JsonConverterFailed_RemoteData = 5,
		Download_JsonConverterFailed_RepData    = 6,
		MAX                                     = 7
	};

	/**
	 * Enum Sheik.ESheikPlayerDataCall
	 */
	enum class ESheikPlayerDataCall : uint8_t
	{
		Download = 0,
		Upload   = 1,
		MAX      = 2
	};

	/**
	 * Enum Sheik.ERedemptionCodeConsumerType
	 */
	enum class ERedemptionCodeConsumerType : uint8_t
	{
		none        = 0,
		eos         = 1,
		psn         = 2,
		xbl         = 3,
		fan_mail    = 4,
		battle_pass = 5,
		codes       = 6,
		consolation = 7,
		MAX         = 8
	};

	/**
	 * Enum Sheik.ESeasonFieldOrder
	 */
	enum class ESeasonFieldOrder : uint8_t
	{
		ESFO_Lifetime  = 0,
		ESFO_Watermark = 1,
		ESFO_Count     = 2,
		ESFO_MAX       = 3
	};

	/**
	 * Enum Sheik.EComplexStatArithmeticOperations
	 */
	enum class EComplexStatArithmeticOperations : uint8_t
	{
		None     = 0,
		Add      = 1,
		Subtract = 2,
		Multiply = 3,
		Divide   = 4,
		MAX      = 5
	};

	/**
	 * Enum Sheik.EComplexStatComparisonMethod
	 */
	enum class EComplexStatComparisonMethod : uint8_t
	{
		Arithmetic = 0,
		Min        = 1,
		Max        = 2
	};

	/**
	 * Enum Sheik.ESheikEntitlementsCallError
	 */
	enum class ESheikEntitlementsCallError : uint8_t
	{
		QueryEntitlements    = 0,
		SyncOfflinePurchases = 1,
		OfferExpired         = 2,
		WalletSystemNotReady = 3,
		MAX                  = 4
	};

	/**
	 * Enum Sheik.ESheikStoreCallError
	 */
	enum class ESheikStoreCallError : uint8_t
	{
		Purchase             = 0,
		Redeem               = 1,
		SyncOfflinePurchases = 2,
		Authentication       = 3,
		MAX                  = 4
	};

	/**
	 * Enum Sheik.ESheikTeammateHeightDirection
	 */
	enum class ESheikTeammateHeightDirection : uint8_t
	{
		None        = 0,
		SlightAbove = 1,
		Above       = 2,
		SlightBelow = 3,
		Below       = 4,
		MAX         = 5
	};

	/**
	 * Enum Sheik.ESheikTeammatePointerDirection
	 */
	enum class ESheikTeammatePointerDirection : uint8_t
	{
		Down  = 0,
		Up    = 1,
		Left  = 2,
		Right = 3,
		MAX   = 4
	};

	/**
	 * Enum Sheik.ESheikTitleStorageCallError
	 */
	enum class ESheikTitleStorageCallError : uint8_t
	{
		EnumerateFiles   = 0,
		FileRead         = 1,
		LegalDocsGet     = 2,
		LegalDocNotFound = 3,
		LegalDocAccept   = 4,
		MAX              = 5
	};

	/**
	 * Enum Sheik.EUIDataRequestType
	 */
	enum class EUIDataRequestType : uint8_t
	{
		NoticeData             = 0,
		LegalDocuments         = 1,
		GlobalNoticeControls   = 2,
		RMTEntitlementImages   = 3,
		FeatureEntitlements    = 4,
		GameModeModuleData     = 5,
		RMTCategoryDefinitions = 6,
		MAX                    = 7
	};

	/**
	 * Enum Sheik.ESheikCreditsRowType
	 */
	enum class ESheikCreditsRowType : uint8_t
	{
		ESCR_Header    = 0,
		ESCR_Subheader = 1,
		ESCR_Image     = 2,
		ESCR_Name      = 3,
		ESCR_MAX       = 4
	};

	/**
	 * Enum Sheik.ESheikPresetSlotType
	 */
	enum class ESheikPresetSlotType : uint8_t
	{
		SPST_Preset = 0,
		SPST_Outfit = 1,
		SPST_MAX    = 2
	};

	/**
	 * Enum Sheik.ESheikMoveType
	 */
	enum class ESheikMoveType : uint8_t
	{
		ESMT_None        = 0,
		ESMT_Core        = 1,
		ESMT_Arms        = 2,
		ESMT_Legs        = 3,
		ESMT_CoreAndArms = 4,
		ESMT_CoreAndLegs = 5,
		ESMT_ArmsAndLegs = 6,
		ESMT_All         = 7,
		ESMT_MAX         = 8
	};

	/**
	 * Enum Sheik.ESheikWaypointVerticalDirection
	 */
	enum class ESheikWaypointVerticalDirection : uint8_t
	{
		None     = 0,
		WVD_Up   = 1,
		WVD_Down = 2,
		MAX      = 3
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct Sheik.SheikWeightRegionTypeProbability
	 * Size -> 0x0008
	 */
	struct FSheikWeightRegionTypeProbability
	{
	public:
		int32_t                                                    NumerOfTimesEnteredInLottery;                            // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExtraWeightForBeingEquipped;                             // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Sheik.AIButtonInputEvent
	 * Size -> 0x0008
	 */
	struct FAIButtonInputEvent
	{
	public:
		EMoveTrack                                                 InputEventTrack;                                         // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V15R[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ReleaseTime;                                             // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Sheik.AIDirectionInputEvent
	 * Size -> 0x0010
	 */
	struct FAIDirectionInputEvent
	{
	public:
		struct FVector2D                                           LocalInputDirection;                                     // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReleaseTime;                                             // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsValid;                                                // 0x000C(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GCH9[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Sheik.SheikAIProfileWeaponUseSettings
	 * Size -> 0x002C
	 */
	struct FSheikAIProfileWeaponUseSettings
	{
	public:
		float                                                      WeaponSearchChance;                                      // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EnvironmentalWeaponSearchChance;                         // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AllowNormalWeapons;                                      // 0x0008(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AllowLargeWeapons;                                       // 0x0009(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AllowWeaponPocketing;                                    // 0x000A(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0R38[0x1];                                   // 0x000B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PocketBoxChance;                                         // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      UnpocketWeaponWhileWanderingChance;                      // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       UseWeaponsInCombat;                                      // 0x0014(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_35RH[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      UnpocketWeaponInCombatChance;                            // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WeaponSearchWhileTargetOTGChance;                        // 0x001C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PreferViciousWeaponAttacksChance;                        // 0x0020(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WeaponThrowChance;                                       // 0x0024(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       SeekWeaponUpgrades;                                      // 0x0028(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0DXS[0x3];                                   // 0x0029(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Sheik.BotAttackOptions
	 * Size -> 0x0018
	 */
	struct FBotAttackOptions
	{
	public:
		int32_t                                                    DefaultDistribution;                                     // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SuperstarDistribution;                                   // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CooldownBeforeMoveReuse;                                 // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_J7P8[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UIGMoveMontage*                                      Montage;                                                 // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Sheik.SheikAIProfileOptions
	 * Size -> 0x0130
	 */
	struct FSheikAIProfileOptions
	{
	public:
		class FName                                                ProfileName;                                             // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             FlirtTargetSearchRadius;                                 // 0x0008(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ItemSearchRadius;                                        // 0x0014(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FGameplayTagContainer>                       ItemPriorities;                                          // 0x0018(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      ItemSearchHorizontalCullDistance;                        // 0x0028(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       DropEquippedMagazines;                                   // 0x002C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7FVE[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxStatPodSlotsToUse;                                    // 0x0030(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSheikAIProfileWeaponUseSettings                    WeaponUseSettings;                                       // 0x0034(0x002C) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		float                                                      AttackMissChance;                                        // 0x0060(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AttackMissDistanceBuffer;                                // 0x0064(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DodgeAfterHitChance;                                     // 0x0068(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DodgeAfterMissChance;                                    // 0x006C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      IgnoreTeammateInCombatChance;                            // 0x0070(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PostKillEmoteChance;                                     // 0x0074(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WallSplatFollowupTime;                                   // 0x0078(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M0J4[0x4];                                   // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<EBotAttackOption, struct FBotAttackOptions>           Moveset;                                                 // 0x0080(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<EBotAttackOption, struct FBotAttackOptions>           WakeupMoveset;                                           // 0x00D0(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		float                                                      MaxSprintDuration;                                       // 0x0120(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SprintCooldownDuration;                                  // 0x0124(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AllowSprintingWhileTargetStaminaBroken;                  // 0x0128(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AllowSprintingWhileTargetStunned;                        // 0x0129(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YB9S[0x6];                                   // 0x012A(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Sheik.SheikBotEmoteInfo
	 * Size -> 0x0050
	 */
	struct FSheikBotEmoteInfo
	{
	public:
		unsigned char                                              Montage[0x28];                                           // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		struct FGameplayTagContainer                               GameplayTags;                                            // 0x0028(0x0020) BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		class FName                                                MontageName;                                             // 0x0048(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Sheik.SheikAITargetTicket
	 * Size -> 0x0014
	 */
	struct FSheikAITargetTicket
	{
	public:
		struct FGuid                                               TargetGuid;                                              // 0x0000(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NumTargeting;                                            // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Sheik.SheikAITargetContainer
	 * Size -> 0x0018
	 */
	struct FSheikAITargetContainer
	{
	public:
		TArray<struct FSheikAITargetTicket>                        Targets;                                                 // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    MaxSimultaneousTargets;                                  // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FColor                                              DebugDrawColor;                                          // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Sheik.SheikAISpawnerSettings
	 * Size -> 0x0028
	 */
	struct FSheikAISpawnerSettings
	{
	public:
		class UIGDataTable*                                        BotOutfitTable;                                          // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UIGDataTable*                                        BotTeamOutfitTable;                                      // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UIGDataTable*                                        BotEmoteTable;                                           // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TeamOutfitChance;                                        // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OverrideNameChance;                                      // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UIGDataTable*                                        BotTitleCardTable;                                       // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Sheik.SheikPayload
	 * Size -> 0x01E0
	 */
	struct FSheikPayload
	{
	public:
		TMap<class FString, class FString>                         StringArguments;                                         // 0x0000(0x0050) NativeAccessSpecifierPublic
		TMap<class FString, class FText>                           TextArguments;                                           // 0x0050(0x0050) NativeAccessSpecifierPublic
		TMap<class FString, int32_t>                               IntArguments;                                            // 0x00A0(0x0050) NativeAccessSpecifierPublic
		TMap<class FString, float>                                 FloatArguments;                                          // 0x00F0(0x0050) NativeAccessSpecifierPublic
		TMap<class FString, bool>                                  BooleanArguments;                                        // 0x0140(0x0050) NativeAccessSpecifierPublic
		unsigned char                                              Texture2DArguments[0x50];                                // 0x0190(0x0050) UNKNOWN PROPERTY: MapProperty
	};

	/**
	 * ScriptStruct Sheik.SheikAnnouncement
	 * Size -> 0x0200
	 */
	struct FSheikAnnouncement
	{
	public:
		int32_t                                                    AnnouncementId;                                          // 0x0000(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESheikAnnouncementType                                     AnnouncementType;                                        // 0x0004(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESheikAnnouncementPriority                                 AnnouncementPriority;                                    // 0x0005(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bStartPlayingOverCurrentAnnouncementIfHigherPriority;    // 0x0006(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZDZ1[0x1];                                   // 0x0007(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SpeedFactor;                                             // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSpeedUpIfQueueIsLarge;                                  // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsCountdown;                                            // 0x000D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BLAW[0xA];                                   // 0x000E(0x000A) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSheikPayload                                       Payload;                                                 // 0x0018(0x01E0) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		bool                                                       bIsAnnouncementPlaying;                                  // 0x01F8(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_07T5[0x7];                                   // 0x01F9(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Sheik.SheikMusicInfo
	 * Size -> 0x0030
	 */
	struct FSheikMusicInfo
	{
	public:
		class USoundBase*                                          AudioToPlay;                                             // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VolumeMultiplier;                                        // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PitchMultiplier;                                         // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartTime;                                               // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8HP5[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USoundConcurrency*                                   ConcurrencySettings;                                     // 0x0018(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FadeOutDuration;                                         // 0x0020(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FadeOutVolume;                                           // 0x0024(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAudioFaderCurve                                           FaderCurve;                                              // 0x0028(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NRHX[0x7];                                   // 0x0029(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Sheik.TargetDescription
	 * Size -> 0x000C
	 */
	struct FTargetDescription
	{
	public:
		struct FIntPoint                                           Resolution;                                              // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IgnoreScalability;                                       // 0x0008(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L40A[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Sheik.SheikStatFormatOptions
	 * Size -> 0x0020
	 */
	struct FSheikStatFormatOptions
	{
	public:
		class FText                                                UnitOfMeasure;                                           // 0x0000(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		int32_t                                                    DecimalPlaces;                                           // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MultiplyByScale;                                         // 0x001C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Sheik.SheikPlayerDataStat
	 * Size -> 0x00CC (FullSize[0x00D8] - InheritedSize[0x000C])
	 */
	struct FSheikPlayerDataStat : public FIGStat
	{
	public:
		unsigned char                                              UnknownData_3WCE[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                DisplayName;                                             // 0x0010(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		class FName                                                LifetimeStatName;                                        // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                WatermarkStatName;                                       // 0x0030(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                LiveSeasonLifetimeStatName;                              // 0x0038(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                LiveSeasonWatermarkStatName;                             // 0x0040(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LifetimeValue;                                           // 0x0048(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WatermarkValue;                                          // 0x004C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LiveSeasonLifetimeValue;                                 // 0x0050(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LiveSeasonWatermarkValue;                                // 0x0054(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsTextValue;                                            // 0x0058(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Z4TJ[0x7];                                   // 0x0059(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                TextValue;                                               // 0x0060(0x0018) NativeAccessSpecifierPublic
		class FText                                                LifetimeTextValue;                                       // 0x0078(0x0018) BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		class FText                                                LiveSeasonLifetimeTextValue;                             // 0x0090(0x0018) BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		float                                                      CoolNumberThreshold;                                     // 0x00A8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MinimumIsBetter;                                         // 0x00AC(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
