#pragma once

/**
 * Name: Rumbleverse
 * Version: Latest
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * UserDefinedStruct STRUCT_PowderRotations.STRUCT_PowderRotations
	 * Size -> 0x0060
	 */
	struct FSTRUCT_PowderRotations
	{
	public:
		struct FRotator                                            AlfaPowderRotation_20_AF1DA91A4F1A9A23C9866D83E45DA8E0;  // 0x0000(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FRotator                                            BravoPowderRotation_21_9FFAD62E4DD44562AA957383B9CC0681; // 0x000C(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FRotator                                            CharliePowderRotation_22_2A06D6B942AE56831980FC8D383657FF; // 0x0018(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FRotator                                            DeltaPowderRotation_23_469244DF4C19A82B3FD239962C70308F; // 0x0024(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FRotator                                            EchoPowderRotation_24_0E5B96F143291F11CC45AE9348A7B9DE;  // 0x0030(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FRotator                                            FoxtrotPowderRotation_25_CF5CD13646760FC7CFC2BA8E63028785; // 0x003C(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AlfaPowderLifetime_37_7222C8444946FF121DFB859B334B1078;  // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      BravoPowderLifetime_36_5D80A2D34905AE2B3ED4CBBCFC723D3C; // 0x004C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      CharliePowderLifetime_35_AAB43A1C427A69EEFF583BBAFDA93D35; // 0x0050(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      DeltaPowderLifetime_34_6EA0E2F745D45C0C39A8A9856D1DA38C; // 0x0054(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      EchoPowderLifetime_33_1C31F62C4DA2A81714C685A724EA6EB6;  // 0x0058(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      FoxtrotPowderLifetime_32_335D87EB4DFB3205B6723C809A96E930; // 0x005C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
