#pragma once

/**
 * Name: Rumbleverse
 * Version: Latest
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * UserDefinedStruct STRUCT_ScaleHolder.STRUCT_ScaleHolder
	 * Size -> 0x0060
	 */
	struct FSTRUCT_ScaleHolder
	{
	public:
		struct FVector                                             scale_01_8_D0F861DD4243967CFE87A6BD77DEAD2B;             // 0x0000(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             scale_02_9_7E10396B4861B967229B198DE905CCBE;             // 0x000C(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             scale_03_10_782E5F3447689BC5812F63841E6A72FF;            // 0x0018(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             scale_04_11_8597047648653C7EE9808797591EA7B6;            // 0x0024(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             scale_05_12_CC2B08CC48BD9184C02DEB9F0F7276C4;            // 0x0030(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             scale_06_13_17C1D4AA4DFFA44944EBE1BF6B7D674F;            // 0x003C(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             scale_07_14_C38358774D8945C6CCCFA58C5A41EEE2;            // 0x0048(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             scale_08_16_B011773F4FB22903B69C0BAB30B6CEA2;            // 0x0054(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
