#pragma once

/**
 * Name: Rumbleverse
 * Version: Latest
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.GetAccountsManager
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_GetAccountsManager_Params
	{
	public:
		class USheikPlayerAccountsManager*                         AccountsManager;                                         // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.GetAgeGatingManager
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_GetAgeGatingManager_Params
	{
	public:
		class USheikAgeGatingManager*                              AgeGatingManager;                                        // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.UpdateSubmitButton
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_UpdateSubmitButton_Params
	{	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.OnDeactivated
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_OnDeactivated_Params
	{	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.BndEvt__WBP_Sheik_Title_KidsWebServicesEmailEntry_EmailTextBox_K2Node_ComponentBoundEvent_2_TextCommitted__DelegateSignature
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_BndEvt__WBP_Sheik_Title_KidsWebServicesEmailEntry_EmailTextBox_K2Node_ComponentBoundEvent_2_TextCommitted__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.OnActivated
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_OnActivated_Params
	{	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.BndEvt__WBP_Sheik_Title_KidsWebServicesEmailEntry_EmailTextBox_K2Node_ComponentBoundEvent_3_TextboxSelected__DelegateSignature
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_BndEvt__WBP_Sheik_Title_KidsWebServicesEmailEntry_EmailTextBox_K2Node_ComponentBoundEvent_3_TextboxSelected__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.BndEvt__WBP_Sheik_Title_KidsWebServicesEmailEntry_EmailTextBox_K2Node_ComponentBoundEvent_4_TextChanged__DelegateSignature
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_BndEvt__WBP_Sheik_Title_KidsWebServicesEmailEntry_EmailTextBox_K2Node_ComponentBoundEvent_4_TextChanged__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.OnInputSelect
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_OnInputSelect_Params
	{
	public:
		struct FInputEventData                                     InputEventData;                                          // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.PreConstruct
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.BndEvt__WBP_Sheik_Title_KidsWebServicesEmailEntry_SubmitButton_K2Node_ComponentBoundEvent_0_OnActionConfirmed__DelegateSignature
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_BndEvt__WBP_Sheik_Title_KidsWebServicesEmailEntry_SubmitButton_K2Node_ComponentBoundEvent_0_OnActionConfirmed__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.OnCommitParentEmail
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_OnCommitParentEmail_Params
	{
	public:
		bool                                                       bSuccessful;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_KE82[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSheikError                                         Error;                                                   // 0x0004(0x000C)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.Construct
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_Construct_Params
	{	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.ExecuteUbergraph_WBP_Sheik_Title_KidsWebServicesEmailEntry
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_ExecuteUbergraph_WBP_Sheik_Title_KidsWebServicesEmailEntry_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_LEYO[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.OnEmailFail__DelegateSignature
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_OnEmailFail__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.OnFail__DelegateSignature
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_OnFail__DelegateSignature_Params
	{
	public:
		struct FSheikError                                         Error;                                                   // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	};

	/**
	 * Function WBP_Sheik_Title_KidsWebServicesEmailEntry.WBP_Sheik_Title_KidsWebServicesEmailEntry_C.OnFinish__DelegateSignature
	 */
	struct UWBP_Sheik_Title_KidsWebServicesEmailEntry_C_OnFinish__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
